Repository: Proektsoftbg/Calcpad
Catalog: Calcpad.Wpf/AppMessages.*.resx
Languages: bg, zh

# ReportUnhandledExceptionAndClose_NoUnsavedData
source: There is no unsaved data. If the problem persists, please contact proektsoft.bg@gmail.com.
bg: Няма незаписани данни. Ако проблемът продължи, моля пишете на proektsoft.bg@gmail.com.
zh: 没有未保存的数据. 如果问题仍然存在，请联系proektsoft.bg@gmail.com.

# ReportUnhandledExceptionAndClose_NoUnsavedData_RecoveryAttempted
source: Calcpad saved your work and tried to recover automatically.
bg: Calcpad запази вашите данни и се опита да се възстанови автоматчно.
zh: Calcpad已保存您的工作并尝试自动恢复.

# ReportUnhandledExceptionAndClose_UnsavedData_RecoveryFailed
source: There was unsaved data. Calcpad tried, but was unable to recover. If the problem persists, please contact proektsoft.bg@gmail.com.
bg: Има незаписани данни. Възстановяването беше неуспешно. Ако проблемът продължи, моля пишете на proektsoft.bg@gmail.com.
zh: 有未保存的数据. Calcpad已尝试，但无法恢复. 如果问题仍然存在，请联系proektsoft.bg@gmail.com.

# ExceptionDetails
source: Exception details: "{0}"
bg: Информация за грешката: "{0}"
zh: 异常信息详情： "{0}"

# UnexpectedErrorOccurred
source: Unexpected error occurred in Calcpad: "{0}" Source: "{1}"
bg: В Calcpad възникна неочаквана грешка: "{0}" Източник: "{1}"
zh: Calcpad中发生意外错误： "{0}" 来源： "{1}"

source: File not found.
bg: Файлът не е намерен.
zh: 文件未找到.

source: Undeclared function.
bg: Недекларирана функция.
zh: 未声明的函数.

source: Invalid syntax.
bg: Невалиден синтаксис.
zh: 无效的语法.

source: Undeclared variable.
bg: Недекларирана променлива.
zh: 未声明的变量.

source: Undefined units.
bg: Недефинирани мерни единици.
zh: 未定义的单位.

source: Undefined macro or parameter.
bg: Недефиниран макрос или параметър.
zh: 未定义的宏或参数.

source: Invalid compiler directive.
bg: Невалидна директива за компилатор.
zh: 编译器指令无效.

source: Invalid method.
bg: Невалиден метод.
zh: 无效方法.

source: Error getting input fields values.
bg: Грешка при чете на стойностите на входните данни.
zh: 获取输入值时出错.

# ErrorString
source: #Error
bg: Грешка
zh: 错误

source: Single expression expected.
bg: Очаква се единичен израз.
zh: 应为单个表达式.

source: End of line expected.
bg: Очаква се край на ред.
zh: 应置于行尾.
