Repository: Proektsoftbg/Calcpad
Catalog: Calcpad.Wpf/Constants.*.resx
Languages: bg_bg

source: Pi number
bg_bg: Числото Пи

source: Euler number
bg_bg: Неперово число

source: Euler constant
bg_bg: Константа на Ойлер

source: Golden ratio
bg_bg: Златно сечение

# GravitationalAcceleration
source: Gravitational acceleration on Earth
bg_bg: Земно ускорение

source: Gravitational constant
bg_bg: Гравитационна константа

source: Earth mass
bg_bg: Земна маса

source: Solar mass
bg_bg: Слънчева маса

# SpeedOfLight
source: Speed of light in vacuum
bg_bg: Скорост на светлината във вакуум

source: Planck constant
bg_bg: Константа на Планк

# VacuumPermeability
source: Vacuum magnetic permeability
bg_bg: Магнитна проницаемост на вакуума

# VacuumPermitivity
source: Vacuum electric permittivity
bg_bg: Диелектрична проницаемост на вакуума

source: Coulomb constant
bg_bg: Константа на Кулон

source: Elementary charge
bg_bg: Елементарен заряд

source: Electron mass
bg_bg: Маса на електрона

source: Proton mass
bg_bg: Маса на протона

source: Neutron mass
bg_bg: Маса на неутрона

source: Avogadro constant
bg_bg: Число на Авогадро

source: Stefan–Boltzmann constant
bg_bg: Константа на Стефан-Болцман

source: Boltzmann constant
bg_bg: Константа на Болцман

source: Molar gas constant
bg_bg: Универсална газова константа

source: Faraday constant
bg_bg: Константа на Фарадей

source: Unit weight of concrete
bg_bg: Обемно тегло на бетона

source: Unit weight of steel
bg_bg: Обемно тегло на стоманата

source: Unit weight of aluminium
bg_bg: Обемно тегло на алуминия

source: Unit weight of glass
bg_bg: Обемно тегло на стъклото

source: Unit weight of water
bg_bg: Обемно тегло на водата

source: Factorial
bg_bg: Факториел

source: Operators
bg_bg: Оператори

source: Exponentiation
bg_bg: Степенуване

source: Division
bg_bg: Деление

source: Division Bar
bg_bg: Дробна черта

source: Integer Division
bg_bg: Целочислено делене

# Modulo
source: Modulo (reminder)
bg_bg: Остатък

source: Multiplication
bg_bg: Умножение

source: Subtraction
bg_bg: Изваждане

source: Addition
bg_bg: Събиране

source: Equal To
bg_bg: Равно (сравнение)

source: Not Equal To
bg_bg: Не равно

source: Less Than
bg_bg: По-малко

source: Less Than or Equal
bg_bg: По-малко или равно

source: Greater Than
bg_bg: По-голямо

source: Greater Than or Equal
bg_bg: По-голямо или равно

# LogicalAnd
source: Logical &quot;And&quot;
bg_bg: Логическо &quot;И&quot; (And)

# LogicalOr
source: Logical &quot;Or&quot;
bg_bg: Логическо &quot;ИЛИ&quot; (Or)

# LogicalXor
source: Logical &quot;Xor&quot;
bg_bg: Изключващо &quot;ИЛИ&quot; (Xor)

source: Assignment
bg_bg: Присвояване

source: Functions
bg_bg: Функции

source: Trigonometric
bg_bg: Тригонометрични

source: Sine
bg_bg: Синус

source: Cosine
bg_bg: Косинус

source: Tangent
bg_bg: Тангенс

source: Cosecant
bg_bg: Косеканс

source: Secant
bg_bg: Секанс

source: Cotangent
bg_bg: Котангенс

source: Hyperbolic Sine
bg_bg: Синус хиперболичен

source: Hyperbolic Cosine
bg_bg: Косинус хиперболичен

source: Hyperbolic Tangent
bg_bg: Тангенс хиперболичен

source: Hyperbolic Cosecant
bg_bg: Косеканс хиперболичен

source: Hyperbolic Secant
bg_bg: Секанс хиперболичен

source: Hyperbolic Cotangent
bg_bg: Котангенс хиперболичен

source: Hyperbolic
bg_bg: Хиперболични

source: Inverse Trigonometric
bg_bg: Обратни тригонометрични

source: Inverse Sine
bg_bg: Аркуссинус

source: Inverse Cosine
bg_bg: Аркускосинус

source: Inverse Tangent
bg_bg: Аркустангенс

# AngleWhoseTangentIsXDividedByY
source: The angle whose tangent is x/y
bg_bg: Ъгъл, чиито тангенс е отношението на x към y

source: Inverse Cosecant
bg_bg: Аркускосеканс

source: Inverse Secant
bg_bg: Аркуссеканс

source: Inverse Cotangent
bg_bg: Аркускотангенс

source: Inverse Hyperbolic
bg_bg: Обратни хиперболични

source: Inverse Hyperbolic Sine
bg_bg: Аркуссинус хиперболичен

source: Inverse Hyperbolic Cosine
bg_bg: Аркускосинус хиперболичен

source: Inverse Hyperbolic Tangent
bg_bg: Аркустангенс хиперболичен

source: Inverse Hyperbolic Cosecant
bg_bg: Аркускосеканс хиперболичен

source: Inverse Hyperbolic Secant
bg_bg: Аркуссеканс хиперболичен

source: Inverse Hyperbolic Cotangent
bg_bg: Аркускотангенс хиперболичен

source: Logarithmic, Exponential and Roots
bg_bg: Логаритмични, експоненциални и корени

source: Decimal Logarithm
bg_bg: Десетичен логаритъм

source: Natural Logarithm
bg_bg: Натурален логаритъм

source: Binary Logarithm
bg_bg: Двоичен логаритъм

source: Natural Exponent
bg_bg: Експоненциална функция

source: Square Root
bg_bg: Корен квадратен

source: Cubic Root
bg_bg: Корен кубичен

source: n-th Root
bg_bg: Корен n-ти

source: Rounding
bg_bg: Закръгляване

# RoundToNearestInteger
source: Round to the nearest integer
bg_bg: Закръгляване до най-близкото цяло число

source: Round to the lower integer
bg_bg: Закръгляване до по-малкото цяло число

source: Round up to the greater integer
bg_bg: Закръгляване до по-голямото цяло число

source: Round towards zero
bg_bg: Закръгляване към по-близкото число в посока към нулата

source: Integer
bg_bg: Целочислени

# Modulo_Description
source: The modulo (reminder) of an integer division
bg_bg: Остатък от делене

# GreatestCommonDivisor
source: The greatest common divisor of two integers
bg_bg: Най-голям общ делител

# LeastCommonMultiple
source: The least common multiple of two integers
bg_bg: Най-малко общо кратно

source: Complex
bg_bg: Комплексни

# RealPartOfAComplexNumber
source: The real part of a complex number
bg_bg: Реалната част на комплексно число

# ImaginaryPartOfAComplexNumber
source: The imaginary part of a complex number
bg_bg: Имагинерната част на комплексно число

# PhaseOfAComplexNumber
source: The phase of a complex number
bg_bg: Фаза на комплексно число

# AbsoluteValue
source: Absolute value/magnitude
bg_bg: Абсолютна стойност

source: Aggregate and Interpolation
bg_bg: Агрегатни и интерполационни

source: Minimum of multiple values
bg_bg: Най-малката стойност от списъка

source: Maximum of multiple values
bg_bg: Най-голямата стойност от списъка

source: Sum of multiple values
bg_bg: Сума на множество стойности

source: Sum of squares
bg_bg: Сума от квадратите

source: Square root of sum of squares
bg_bg: Корен квадратен от сумата на квадратите

source: Average of multiple values
bg_bg: Средно аритметично на множество стойности

source: Product of multiple values
bg_bg: Произведение на множество стойности

source: Take the n-th element
bg_bg: Връща n-тия елемент от списъка

source: Linear interpolation
bg_bg: Линейна интерполация

source: Hermite spline interpolation
bg_bg: Spline интерполация на Ермит

source: Conditional and Logical
bg_bg: Условни и логически

# ConditionalEvaluation_Function
source: Conditional evaluation
bg_bg: Условно изчисление

# SelectiveEvaluation_Function
source: Selective evaluation
bg_bg: Избирателно изчисление

# LogicalNot_Function
source: Logical not
bg_bg: Логическо отрицание (NOT)

# LogicalAnd_Function
source: Logical and
bg_bg: Логическо &quot;И&quot; (AND)

# LogicalOr_Function
source: Logical or
bg_bg: Логическо &quot;ИЛИ&quot; (OR)

# LogicalXor_Function
source: Logical xor
bg_bg: Изключващо &quot;ИЛИ&quot; (XOR)

source: Other
bg_bg: Други

source: Geometric mean
bg_bg: Средно геометрично

source: Sign of a number
bg_bg: Знак на число

# RandomNumber
source: Random number between 0 and x
bg_bg: Произволно число между 0 и x

# Constants_Header
source: Constants
bg_bg: Константи

# Pi
source: Constant π (pi)
bg_bg: Константа π (пи)
