Repository: Proektsoftbg/Calcpad
Catalog: Calcpad.Wpf/MainWindowResources.*.resx
Languages: bg, zh

# calcpad_download_help_html
source: https://calcpad.eu/download/help.html
bg: https://calcpad.bg/download/help.html
zh: https://calcpad.eu/download/help.zh.html

# TryRestoreState_Recovered_SavePrompt
source: Calcpad recovered from unexpected shutdown. Would you like to restore your unsaved data?
bg: Calcpad се рестартира след неочаквано прекъсване. Желаете ли да се възстановят незаписаните данни?
zh: Calcpad从意外关闭中恢复. 是否要恢复未保存的数据？

# TryRestoreState_Failed
source: Recovery failed with error: "{0}". You can find your unsaved data in "{1}".
bg: Възстановяването беше неуспешно поради грешка: "{0}". Може да намерите незаписаното съдържание в "{1}".
zh: 恢复失败，出现错误： "{0}". 您可以在以下位置找到未保存的数据： "{1}".

source: Input
bg: Входни данни
zh: 输入

source: _Output
bg: _Резултати
zh: 输出

# Inline_Html_elements_must_not_cross_text_lines
source: Stop! Inline Html elements must not cross text lines.
bg: Стоп! Inline Html елементи не могат да пресичат редове от текста.
zh: 停止！行内Html元素不得跨越文本行.

# Command_Open_Text_File
source: Text File (*.txt)|*.txt|Calcpad Worksheet (*.cpd)|*.cpd|Calcpad Compiled (*.cpdz)|*.cpdz
bg: Текстов файл (*.txt)|*.txt|Calcpad документ (*.cpd)|*.cpd|Calcpad двоичен файл (*.cpdz)|*.cpdz
zh: 文本文件(* .txt) | * .txt | Calcpad工作表(* .cpd) | * .cpd | Calcpad已编译(* .cpdz) | * .cpdz

# Command_Open_Calcpad_Worksheet
source: Calcpad Worksheet (*.cpd)|*.cpd|Calcpad Compiled (*.cpdz)|*.cpdz|Text File (*.txt)|*.txt
bg: Calcpad документ (*.cpd)|*.cpd|Calcpad двоичен файл (*.cpdz)|*.cpdz|Текстов файл (*.txt)|*.txt
zh: Calcpad工作表(* .cpd) | * .cpd | 已编译Calcpad(* .cpdz) | * .cpdz |文本文件(* .txt) | * .txt

# SavePrompt
source: File not saved. Save?
bg: Файлът не е записан. Запис?
zh: 文件未保存.保存？

# FileSaveAs_Calcpad_Compiled
source: Calcpad Compiled (*.cpdz)|*.cpdz
bg: Calcpad двоичен файл (*.cpdz)|*.cpdz
zh: 已编译Calcpad(* .cpdz) | * .cpdz

source: Unwarped code
bg: Разгънат код
zh: 未结束代码

# Found_Errors_In_Modules_And_Macros
source: <div class="errorHeader">Found <b>{0}</b> errors in modules and macros:
bg: <div class=\"errorHeader\">Общо <b>{0}</b> грешки в модули и макроси:
zh: <div class="errorHeader">在模块和宏中发现 <b>{0}</b>个错误：

source: Are you sure you want to unlock the source code for editing?
bg: Сигурни ли сте, че искате да отключите изходния код за редактиране?
zh: 确定要解锁源代码进行编辑吗？

# Error_Exporting_Docx_File
source: Error exporting docx file. Display validation log?
bg: Неуспешен запис на docx файл. Да покажа ли списък с грешките?
zh: 导出docx文件时出错.显示验证日志?

source: Open source code for editing (F4)
bg: Отвори програмния код за редактиране (F4)
zh: 打开源代码进行编辑（F4）

source: Compile to input form (F4)
bg: Компилирай до форма за вход на данни (F4)
zh: 编译为输入表单（F4）

source: Error getting units.
bg: Грешка при връщане на мерни единици.
zh: 获取单位时出错.

source: Error! Invalid number. Please correct and then try again.
bg: Грешка! Невалидно число. Моля, направете корекции и опитайте отново.
zh: 错误！无效号码.请更正后重试.

source: Error setting units.
bg: Грешка при задаване на мерни единици.
zh: 设置单位时出错.

source: _File
bg: _Файл
zh: 文件

source: _New
bg: _Нов
zh: 新建

source: _Open
bg: _Отвори
zh: 打开

source: _Recent Files
bg: _Последно отваряни
zh: 最近打开的文件

source: _Save
bg: _Запис
zh: 保存

source: Save _As...
bg: Запис _като...
zh: 另存为...

# CommandLineInterpreter
source: _Command Line Interpreter (CLI)
bg: _Команден интерпретатор (CLI)
zh: 命令行解释器（ CLI ）

source: _Exit
bg: _Изход
zh: 退出

source: _Edit
bg: _Редактор
zh: 编辑

source: _Find
bg: _Търсене
zh: 查找

source: _Replace
bg: _Заместване
zh: 替换

source: _Undo
bg: _Отмени
zh: 取消

source: _Redo
bg: По_втори
zh: 重做

source: Cu_t
bg: _Изрежи
zh: 剪切

source: _Copy
bg: _Копирай
zh: 复制

source: _Paste
bg: _Постави
zh: 粘贴

source: Input Form
bg: Форма за въвеждане
zh: 输入表单

source: Calculate
bg: Изчисляване
zh: 计算

source: Print
bg: Печат
zh: 打印

# OpenWithWord
source: Open With MS Word
bg: Отвори с MS Word
zh: 使用MS Word打开

# SaveAsPDF
source: Save as PDF File
bg: Запис като PDF файл
zh: 另存为pdf文件

source: _Help
bg: _Помощ
zh: 帮助

source: Print Preview
bg: Преглед за отпечатване
zh: 打印预览

# SaveAsHTML
source: Save output as Html file
bg: Запис на резултатите като Html файл
zh: 将输出另存为Html文件

source: Copy all output
bg: Копирай всички резултати
zh: 复制所有输出

source: New file
bg: Нов файл
zh: 新建文件

source: Find and replace
bg: Търсене и заместване
zh: 查找和替换

source: Insert image
bg: Вмъкни изображение
zh: 插入图像

# ShowHideKeypad
source: Show/hide numeric keypad
bg: Покажи/скрий калкулаторна клавиатура
zh: 显示/隐藏数字键盘

# RunAndDisplayOutput
source: Run calculations and display output (F5
bg: Стартирай изчисленията и покажи резултатите (F5)
zh: 运行计算并显示输出（F5)

source: Refresh results after each edit
bg: Автоматично преизчислявай резултатите при промяна на ред
zh: 每次编辑后刷新结果

source: Angles:
bg: Ъгли:
zh: 角度:

source: Non-metric units:
bg: Неметр. единици:
zh: 非国际单位制:

source: Equation format:
bg: Изглед на формули:
zh: 代数式格式:

source: Numbers:
bg: Числа:
zh: 数字:

source: Code
bg: Код
zh: 代码

# KeypadLabel
source: ┌── Numbers ──┐ ┌───── Operators ──────┐ ┌──────── Functions ────────┐
bg: ┌──── Числа ───┐ ┌───── Оператори ────┐ ┌───────── Функции ────────┐
zh: ┌───── 数字 ────┐ ┌────── 运算符 ──────┐ ┌─────────── 函数 ───────────┐

source: Function Plot
bg: Графика на функция
zh: 函数绘图

source: Simple Plot
bg: Единична
zh: 简单绘图

source: Parametric
bg: Параметрична
zh: 参数绘图

source: Multiple
bg: Паралелни
zh: 多函数单图

source: Multiple Parametric
bg: Паралелни параметрични
zh: 多参数函数图

# 2DColorMap
source: 2D color map of a surface
bg: Изохроми на повърхнина
zh: 曲面的2D彩色映射图

source: Numerical Method
bg: Числен метод
zh: 数值方法

# RootFindingForXEqualsConst
source: Root Finding for f(x)=const
bg: Търсене на корен на уравнението f(x)=const
zh: 求f(x)=常量的根

# RootFindingForXEqualsZero
source: Root Finding for f(x)=0
bg: Търсене на корен на уравнението f(x)=0
zh: 求f(x)=0的根

source: Non-Strict Root Finding
bg: Нестрого търсене на корен
zh: 非严格求根

# LocalMaximum
source: Local Maximum of a Function
bg: Локален максимум на функция
zh: 函数的局部最大值

# LocalMinimum
source: Local minimum of a function
bg: Локален минимум на функция
zh: 函数的局部最小值

source: Adaptive Gauss-Lobatto Integration
bg: Числено интегриране (Adaptive Gauss-Lobatto)
zh: 自适应高斯-洛巴托(Gauss-Lobatto)积分

source: Tanh-Sinh Integration
bg: Числено интегриране (Tanh-Sinh квадратура)
zh: Tanh-Sinh积分

source: Numerical Differentiation
bg: Числено диференциране
zh: 数值微分

source: General Inline Iterative Procedure
bg: Обща итеративна процедура
zh: 一般行内迭代程序

source: Iterative Sum
bg: Итеративна сума
zh: 迭代和

source: Iterative Product
bg: Итеративно произведение
zh: 迭代积

source: Program Flow Control
bg: Условно разклонение
zh: 程序流控制

source: Simple: if-end if
bg: Единично: if-end if
zh: 简单： if-end if

source: Alternative: if-else-end if
bg: Алтернативно: if-else-end if
zh: 选择性执行： if-else-end if

# CompleteIfElseIfElseIfEndIf
source: Complete: if-else if-else-end if
bg: Пълно: if-else if-else-end if
zh: 完备型选择执行： if-else if-else-end if

source: Iteration
bg: Цикъл
zh: 迭代

source: Simple: repeat-loop
bg: Стандартен: repeat-loop
zh: 简单循环：repeat-loop

source: Conditional: repeat-break-loop
bg: Условен: repeat-break-loop
zh: 有条件的循环：repeat-break-loop

source: Conditional: repeat-continue-loop
bg: Условен: repeat-continue-loop
zh: 有条件的循环： repeat-continue-loop

source: String Variable or Macro
bg: Текстова променлива или макрос
zh: 字符串变量或宏

source: Inline String Variable
bg: Едноредова текстова променлива
zh: 行内字符串变量

source: Multiline String Variable
bg: Многоредова текстова променлива
zh: 多行字符串变量

source: Inline Macro
bg: Едноредов макрос
zh: 单行宏

source: Multiline Macro
bg: Многоредов макрос
zh: 多行宏

source: Include External File
bg: Външен файл (модул)
zh: 包含外部文件

source: Heading 3
bg: Заглавие 3
zh: 标题 3

source: Heading 4
bg: Заглавие 4
zh: 标题 4

source: Heading 5
bg: Заглавие 5
zh: 标题 5

source: Heading 6
bg: Заглавие 6
zh: 标题 6

source: Paragraph
bg: Абзац
zh: 段落

source: Line Break
bg: Прекъсване на ред
zh: 换行符

source: Bold
bg: Получер
zh: 粗体

source: Italic
bg: Курсив
zh: 斜体

source: Underline
bg: Подчертан
zh: 下划线

# Strikethrough
source: Striketrough
bg: Задраскан
zh: 删除线(横贯线)

source: Subscript
bg: Долен индекс
zh: 下标

source: Superscript
bg: Горен индекс
zh: 上标

source: Red Color
bg: Червен
zh: 红色

source: Folded Div
bg: Сгъваем Div
zh: 折叠

source: Bulleted List
bg: Неномериран списък
zh: 符号列表

source: Numbered List
bg: Номериран списък
zh: 编号清单

source: Image
bg: Изображение
zh: 图像

source: Table
bg: Таблица
zh: 表格

source: Dividing Line
bg: Разделителна линия
zh: 分割线

source: Html UI
bg: Html интерфейс
zh: HTML用户界面

source: Selection
bg: Списък с опции
zh: 选择

source: Radio Buttons
bg: Радио бутони
zh: 单选按钮

source: Checkbox
bg: Отметка
zh: 勾选框

source: Drawing/SVG
bg: SVG чертеж
zh: 图像/SVG

source: Drawing
bg: Чертеж
zh: 图像

source: Line
bg: Линия
zh: 行

source: Rectangle
bg: Правоъгълник
zh: 矩形

source: Circle
bg: Кръг
zh: 圆

source: Ellipse
bg: Елипса
zh: 椭圆

source: Polyline
bg: Полилиния
zh: 折线

source: Polygon
bg: Полигон
zh: 多边形

source: Text
bg: Текст
zh: 文本

# HideContentAfterCurrentLine
source: Hide the content after the current line
bg: Скрий съдържанието надолу в документа
zh: 隐藏当前行后的内容

# AlwaysShowContent
source: Always show the content (default)
bg: Показвай винаги съдържанието (по подразбиране)
zh: 始终显示内容（默认）

# ShowContentBelowOnlyAfterCalc
source: Show the content below only after calculations
bg: Показвай следващото съдържание само в резултатите
zh: 仅在计算后显示以下内容

# ShowContentBelowOnlyBeforeCalc
source: Show the content below only before calculations
bg: Показвай следващото съдържание само при въвеждане
zh: 仅在计算前显示以下内容

# PauseCalculation
source: Pause the calculations and wait
bg: Спри изчисленията на пауза и чакай
zh: 暂停计算并等待

source: Output Visibility Control
bg: Контрол на видимостта
zh: 输出可见性控制

# PauseExecutionAndDisplayInputForm
source: Pause the execution and display an input form
bg: Спри изчисленията на пауза и покажи форма за въвеждане
zh: 暂停执行并显示输入表单

# ShowCompleteEquations
source: Show the complete equations (default)
bg: Показвай пълните формули (по подразбиране)
zh: 显示完整的代数式（默认）

# ShowEquationsWithoutCalculating
source: Show the equations, but without calculating
bg: Показвай уравненията но без да се изчисляват
zh: 显示代数式，但不计算

# ShowOnlyCalculatedValues
source: Show only the calculated values
bg: Показвай само изчислените стойности
zh: 仅显示计算值

# RoundToTheSpecifiedDigits
source: Round to the specified digits after the decimal point
bg: Закръглявай до посочения брой цифри след десетичната точка
zh: 舍入到小数点后指定位数

# SetAngleDegrees
source: Set angle measurement in degrees
bg: Ъгли в градуси
zh: 设置角度单位为度

# SetAngleRadians
source: Set angle measurement in radians
bg: Ъгли в радиани
zh: 设置角度单位为弧度

# SetAngleGrades
source: Set angle measurement in grades
bg: Ъгли в гради
zh: 设置角度单位为坡度

# ShowEquationsOnlyWithSubstitutedValues
source: Show equations only with substituted values (no variables)
bg: Показване на уравнения само със заместени стойности (без променливи)
zh: 仅使用替换值（无变量）显示方程

# ShowEquationsWithVariablesAndSubstitutedValues
source: Show equations with variables and substituted values (default)
bg: Показване на уравнения с променливи и заместени стойности (по подразбиране)
zh: 显示带有变量和代入值的代数式（默认）

# SplitEquations
source: Split equations that do not fit on a single line
bg: Разделяне на уравнения, които не се побират на един ред
zh: 拆分不适合单线的公式

# WrapEquations
source: Wrap equations that do not fit on a single line (default)
bg: Обвиване на уравнения, които не се побират на един ред (по подразбиране)
zh: 换行公式不适用于单行（默认）

# DoNotSubstituteVariables
source: Do not substitute variables (no substitution)
bg: Без заместване на променливи
zh: 请勿替换变量（无替换）

source: _Insert
bg: _Вмъкни
zh: 插入

# NumberOfDigitsTooltip
source: Number of digits after the decimal point
bg: Брой цифри след десетичната точка
zh: 小数点后位数

source: digits
bg: цифри
zh: 数字

# SubstituteTooltip
source: Substitute variables in equations
bg: Замействай стойностите на променливите във формулите
zh: 代入方程中的变量值

source: Substitute
bg: Заместване
zh: 代入

source: Plot:
bg: Графики:
zh: 绘图:

source: Adaptive
bg: Адапт.
zh: 自适应

# AdaptiveTooltip
source: Adaptive 1D function plot
bg: Адаптивни 1D графики на функции
zh: 自适应一维函数图

source: Shadows:
bg: Сенки:
zh: 阴影:

# ShadowsTooltip
source: Draw surface maps with shadows
bg: Чертай повърхнини със светлосенки
zh: 绘制带阴影的投影图

source: Light direction
bg: Посока към източника на светлина
zh: 光照方向

source: North
bg: Север
zh: 北

source: North-east
bg: Североизток
zh: 北-东

source: East
bg: Изток
zh: 东

source: South-east
bg: Югоизток
zh: 南-东

source: South
bg: Юг
zh: 南

source: South-west
bg: Югозапад
zh: 南-西

source: West
bg: Запад
zh: 西

# PaletteTooltip
source: Surface map color scale
bg: Цветна палитра за изохроми на повърхнини
zh: 平面投影图色阶

source: Palette:
bg: Палитра:
zh: 调色盘:

source: None
bg: Няма
zh: 无

source: Gray
bg: Сиво
zh: 灰色

source: Rainbow
bg: Дъга
zh: 彩虹色

source: Terrain
bg: Терен
zh: 地形色

source: Violet-yellow
bg: Виолетово-жълта
zh: 紫罗兰-黄

source: Green-yellow
bg: Зелено-жълта
zh: 绿-黄色

source: Blues
bg: Сини
zh: 蓝色

source: Smooth
bg: Преливка
zh: 平滑

# SmoothTooltip
source: Smooth shading for surface map
bg: Плавно преливане на цветовете
zh: 曲面投影的阴影平滑

# ExternalBrowser
source: Ext. browser:
bg: Браузър:
zh: 外部浏览器:

# ExternalBrowserTooltip
source: External browser for opening links in reports
bg: Външен браузър за отваряне на линкове от записки
zh: 用于在报告中打开链接的外部浏览器

source: North-west
bg: Северозапад
zh: 北-西

source: Real
bg: Реални
zh: 实数

source: Reset
bg: Изчисти
zh: 重置

source: New line
bg: Нов ред
zh: 新行

source: Inverse functions
bg: Обратни функции
zh: 反三角函数

source: Hyperbolic Functions
bg: Хиперболични функции
zh: 双曲函数

source: Surface map
bg: Изохроми на повърхнина
zh: 曲面投影

# FindRootOfEquation
source: Find a root of equation f(x) = 0
bg: Търсене на корен на уравнението f(x) = 0
zh: 求方程f (x) = 0的根

source: Calculate by iterations
bg: Итерационно изчисление
zh: 迭代计算

source: Finite sum
bg: Крайна сума
zh: 有限连加

source: Finite product
bg: Крайно произведение
zh: 有限连乘

source: Change case
bg: Главни/малки букви
zh: 更改大小写

# Pro
source: Professional
bg: Фигурни
zh: 专业

source: Degrees
bg: Градуси
zh: 度数

source: Grades
bg: Гради
zh: 坡度(grad)

source: Radians
bg: Радиани
zh: 弧度(rad)

source: Inline
bg: Линейни
zh: 行内

source: Backspace
bg: Изтриване назад
zh: 退格键

source: Other
bg: Други
zh: 其他

source: Complex
bg: Комплексни
zh: 复数

source: Open file
bg: Отвори файл
zh: 打开文件

source: Save file
bg: Запис на файла
zh: 保存文件

# CopyText
source: Copy selected text to Clipboard
bg: Копирай избрания текст
zh: 复制选中项到剪贴板

# PasteText
source: Paste text from Clipboard
bg: Постави копирания текст
zh: 从剪贴板粘贴

# RedoEdit
source: Redo
bg: Възстановяване
zh: 重做

# ShowHelp
source: Help
bg: Помощна информация
zh: 帮助

# GreekLetters
source: Greek letters and symbols
bg: Гръцки букви и символи
zh: 希腊字母和符号

# UndoEdit
source: Undo
bg: Отмяна
zh: 取消

# RecentFileList
source: Recent files
bg: Последно отваряни файлове
zh: 最近打开的文件

source: Round
bg: Закр.
zh: 舍入

source: Conditional: while-loop
bg: Условен: while-loop
zh: 条件循环：while-loop

source: With counter: for-loop
bg: С брояч: for-loop
zh: 计数循环:for-loop

source: Max output count:
bg: Макс. бр. елементи:
zh: 最大输出行计数:

source: Maximum number of elements in vector or matrix row/column to display in the output
bg: Максимален брой елементи във вектор или матричен ред/колона за показване в изходната записка
zh: 输出中显示的向量或矩阵行/列最大元素数量

source: Zero small elem.
bg: Нулирай малки елем.
zh: 近似0的小量

source: Display small matrix elements as zero instead of exponent.
bg: Показвай много малки елементи на матрици като нула вместо експоненциален формат.
zh: 将矩阵中的小元素显示为0而非指数.

source: Vector
bg: Векторни
zh: 向量

source: Creational
bg: Създаване и инициализация
zh: 创建相关

source: Structural
bg: Структурни
zh: 结构相关

source: Data
bg: За данни
zh: 数据相关

source: Math
bg: Математически
zh: 计算相关

source: Matrix
bg: Матрични
zh: 矩阵

source: Creates an empty vector with length n
bg: Създава празен вектор с дължина n
zh: 创建一个长度为n的空向量

source: Fills vector v with value x
bg: Запълва вектора v със стойност x
zh: 以x值填充向量v

# CreatesAVectorWithValuesSpanningFromX1ToXnWithStepS
source: Creates a vector with values spanning from x₁ to xₙ with step s
bg: Създава вектор със стойности, в диапазона от x₁ до xₙ със стъпка s
zh: 创建一个向量,元素值从 x? 到x?以步长s变化

source: Returns the length of vector v
bg: Връща дължината на вектора v
zh: 返回向量v的长度

source: The actual size of vector v - the index of the last non-zero element
bg: Реалния размер на вектора v( индексът на последния ненулев елемент)
zh: 向量v的实际长,即最后1个非0元素的索引号

source: Creates a vector by joining the arguments: matrices, vectors and scalars
bg: Създава нов вектор чрез обединяване на аргументите: матрици, вектори и скалари
zh: 通过合并矩阵、向量和标量创建1个向量

# ReturnsThePartOfVectorVBoundedByIndexesIAndIInclusive
source: Returns the part of vector v bounded by indexes i₁ and i₂ inclusive
bg: Връща частта от вектора v, ограничена между индексите i₁ и i₂ включително
zh: 返回向量从 i?到i?的部分

source: Sets a new length n of vector v
bg: Задава нова дължина n на вектора v
zh: 设置向量v的新长度为n

source: The first n elements of vector v
bg: Първите n елемента на вектора v
zh: 向量v的前n个元素

source: The last n elements of vector v
bg: Последните n елемента на вектора v
zh: 向量v的后n个元素

source: Extracts the elements from v which indexes are contained in i
bg: Извлича елементите от v, чиито индекси са дадени във вектор i
zh: 从向量v中按照i给出的索引号提取元素

source: Sorts the elements of vector v in vector ascending order
bg: Подрежда елементите на вектора v във възходящ ред
zh: 将向量v中元素按照升序排列

source: Sorts the elements of vector v in descending order
bg: Подрежда елементите на вектора v в низходящ ред
zh: 将向量v中元素按照降序排列

source: The indexes of vector v, arranged by the ascending order of its elements
bg: Индексите на вектора v, подредени във възходящия ред на елементите му
zh: 由向量的元素升序对应的索引号序列

source: The indexes of vector v, arranged by the descending order of its elements
bg: Индексите на вектора v, подредени в низходящия ред на елементите му
zh: 由向量的元素降序对应的索引号序列

source: A new vector containing the elements of v in reverse order
bg: Нов вектор, съдържащ елементите на v в обратен ред
zh: 一个将向量v元素逆序排列的新向量

source: The number of elements of vector v, starting from the i-th one, that are equal to x
bg: Броят на елементите във вектора v, започвайки от i-тия, които са равни на x
zh: 向量v中自第i个元素起=x的元素个数

source: The index of the first element in v, starting from the i-th one, that is equal to x
bg: Индекса на първия елемент във v, започвайки от i-тия, който е равен на x
zh: 向量v中自第i个元素起=x的第1个元素的索引号

source: The indexes of all elements in v, starting from the i-th one, that are
bg: Индексите на всички елементи във v, започвайки от i-тия, които са равни на x
zh: 向量v中自第i个元素起=x的所有元素的索引号

source: All elements in vector a for which the corresponding elements in vector b are
bg: Всички елементи от вектор a, за които съответните елементи във вектор b са равни
zh: 对应于向量b的向量a中所有元素

source: L2 (Euclidean) norm of vector v
bg: L2 (Евклидова) норма на вектора v
zh: 向量v的L2(Euclidean欧几里得)范数

source: L1 (Manhattan) norm of vector v
bg: L1 (Манхатън) норма на вектора v
zh: 向量v的L1(Manhattan)范数

source: Lp norm of vector v
bg: Lp норма на вектора v
zh: 向量v的Lp范数

source: L∞ (infinity) norm of vector v
bg: L∞ (безкрайна) норма на вектора v
zh: 向量v的L∞(无穷)范数

source: The normalized vector v (with L2 norm = 1)
bg: Нормализирания (единичен№ вектор v (с L2 норма = 1)
zh: 向量v的标准化向量(L2范数=1)

source: Scalar product of two vectors a and b
bg: Скаларно произведение на двата вектора a и b
zh: 向量a和b的标量积

source: Cross product of two vectors a and b (with length 2 or 3)
bg: Векторно произведение на двата вектора a и b (с дължина 2 или 3)
zh: 向量a和b(长度为2或3)的叉积

source: Creates an empty matrix with dimensions m⨯n
bg: Създава празна матрица с размери m⨯n
zh: 创建一个m×n的空矩阵

source: Creates an identity matrix with dimensions n⨯n
bg: Създава единична матрица с размери n⨯n
zh: 创建一个n×n的单位阵

source: Creates a diagonal matrix with dimensions n⨯n and fills the diagonal with value d
bg: Създава диагонална матрица с размери n⨯n и запълва диагонала със стойност d
zh: 创建一个m×n的对角矩阵并赋予对角元素值为d

source: Creates a column matrix with dimensions m⨯1, filled with value c
bg: Създава стълбова матрица с размери m⨯1, запълнена със стойност c
zh: 创建一个m×1的列矩阵并赋予列元素值为c

source: Creates an upper triangular matrix with dimensions n⨯n
bg: Създава горна триъгълна матрица с размери n⨯n
zh: 创建一个n×n的上三角阵

source: Creates a lower triangular matrix with dimensions n⨯n
bg: Създава долна триъгълна матрица с размери n⨯n
zh: 创建一个n×n的下三角阵

source: Creates a symmetric matrix with dimensions n⨯n
bg: Създава симетрична матрица с размери n⨯n
zh: 创建一个n×n的对称阵

source: Creates a diagonal matrix from the elements of vector v
bg: Създава диагонална матрица от елементите на вектор v
zh: 创建一个元素为向量v的元素的对角阵

source: Creates a column matrix from the elements of vector v
bg: Създава стълбова матрица от елементите на вектор v
zh: 创建一个元素为向量v的元素的列矩阵

source: Creates a new matrix by joining column vectors
bg: Създава нова матрица чрез обединяване на вектори в стълбове
zh: 合并列向量创建一个新矩阵

source: Creates a new matrix by joining row vectors
bg: Създава нова матрица чрез обединяване на вектори в редове
zh: 合并行向量创建一个新矩阵

source: Creates a new matrix by appending matrices A; B; C side by side
bg: Създава нова матрица чрез обединяване на матриците A, B, C една до друга
zh: 左右连接矩阵A、B、C创建一个新矩阵

source: Creates a new matrix by stacking matrices A; B; C one below the other
bg: Създава нова матрица чрез обединяване на матриците A, B, C една под друга
zh: 上下堆叠矩阵A、B、C创建一个新矩阵

source: Number of rows in matrix M
bg: Броя на редовете в матрицата M
zh: 矩阵M的行数

source: Number of columns in matrix M
bg: Броя на стълбовете в матрицата M
zh: 矩阵M的列数

source: Sets new dimensions m and n for matrix M
bg: Задава нови размери m и n на матрицата M
zh: 设置矩阵M的新维数m和n

source: Fills matrix M with value x
bg: Запълва матрицата M със стойност x
zh: 以x值填充矩阵M

source: Fills the i-th row of matrix M with value x
bg: Запълва i-тия ред на матрицата M със стойност x
zh: 以x值填充矩阵M的第i行

source: Fills the j-th column of matrix M with value x
bg: Запълва j-тия стълб на матрицата M със стойност x
zh: 以x值填充矩阵M的第i列

source: Copies all elements from A to B, starting from indexes i and j of B
bg: Копира всички елементи от A в B, започвайки от индекси i и j на B
zh: 将A中所有元素复制到B(从索引号 i 和 j 开始)中

source: Adds all elements from A to those of B, starting from indexes i and j of B
bg: Добавя всички елементи от A към тези на B, започвайки от индекси i и j на B
zh: 将A中所有元素+到B(从索引号 i 和 j 开始)中

source: Extracts the i-th row of matrix M as a vector
bg: Извлича i-тия ред на матрицата M като вектор
zh: 提取矩阵M的第i行为一个向量

source: Extracts the j-th column of matrix M as a vector
bg: Извлича j-тия стълб на матрицата M като вектор
zh: 提取矩阵M的第i列为一个向量

source: Extracts the rows from matrix M whose indexes are contained in vector i
bg: Извлича редовете от матрицата M, чиито индекси се съдържат във вектор i
zh: 提取矩阵的行,行数包含在向量i中

source: Extracts the columns from matrix M whose indexes are contained in vector j
bg: Извлича стълбовете от матрицата M, чиито индекси се съдържат във вектор j
zh: 提取矩阵的列,列数包含在向量j中

source: Extracts the diagonal elements of matrix M to a vector
bg: Извлича диагоналните елементи на матрицата M като вектор
zh: 将矩阵M的对角元素提取为一个向量

# ExtractsASubmatrixOfMBoundedByRowsIAndIAndColumnsJAndJIncl
source: Extracts a submatrix of M, bounded by rows i₁ and i₂ and columns j₁ and j₂, incl.
bg: Извлича подматрица на M, ограничена от редовете i₁ до i₂ и стълбовете j₁ до j₂ включително
zh: 提取矩阵M中 i? ~ i? 行、 j?~ j?的块矩阵
