Repository: Proektsoftbg/Calcpad
Catalog: Calcpad.Wpf/MainWindowResources.*.resx
Languages: bg, zh

source: Sorts the columns of M based on the values in row i in ascending order
bg: Подрежда стълбовете на M според стойностите в ред i във възходящ ред
zh: 基于第i行的值对矩阵M的列按升序排列

source: Sorts the columns of M based on the values in row i in descending order
bg: Подрежда стълбовете на M според стойностите в ред i в низходящ ред
zh: 基于第i行的值对矩阵M的列按降序排列

source: Sorts the rows of M based on the values in column j in ascending order
bg: Подрежда редовете на M според стойностите в стълб j във възходящ ред
zh: 基于第j列的值对矩阵M的行按升序排列

source: Sorts the rows of M based on the values in column j in descending order
bg: Подрежда редовете на M според стойностите в стълб j в низходящ ред
zh: 基于第j列的值对矩阵M的行按降序排列

source: The indexes of the columns of M based on the ordering of the values from row i in ascending order
bg: Индексите на стълбовете на M според подреждането на стойностите от ред i във възходящ ред
zh: 矩阵M基于第i行按数值升序排列的列号序列

source: The indexes of the columns of M based on the ordering of the values from row i in descending order
bg: Индексите на стълбовете на M според подреждането на стойностите от ред i в низходящ ред
zh: 矩阵M基于第i行按数值降序排列的列号序列

source: The indexes of the rows of M based on the ordering of the values in column j in ascending order
bg: Индексите на редовете на M според подреждането на стойностите в стълб j във възходящ ред
zh: 矩阵M基于第j列按数值升序排列的行号序列

source: The indexes of the rows of M based on the ordering of the values in column j in descending order
bg: Индексите на редовете на M според подреждането на стойностите в стълб j в низходящ ред
zh: 矩阵M基于第j列按数值降序排列的行号序列

source: Number of occurrences of value x in matrix M
bg: Броя на срещанията на стойност x в матрицата M
zh: 矩阵M中x值出现次数

source: Vector with the two indexes of the first occurrence of x in matrix M, starting from indexes i and j
bg: Вектор с двата индекса на първото срещане на x в матрицата M, започвайки от индекси i и j
zh: 矩阵M中从第i行、j列开始首次出现x值的行列号构成的向量

source: The indexes of all elements in M that are
bg: Индексите на всички елементи в M, които са
zh: 矩阵M中=x值的所有元素的索引号

# TheValuesFromRowIOfMForWhichTheElementsInRowIAre
source: The values from row i₂ of M, for which the elements in row i₁ are
bg: Стойностите от ред i₂ на M, за които елементите в ред i₁ са
zh: 矩阵M中第 i?行中该值所在列对应i?行的值

# TheValuesFromColumnJOfMForWhichTheElementsInColumnJAre
source: The values from column j₂ of M, for which the elements in column j₁ are
bg: Стойностите от стълб j₂ на M, за които елементите в стълб j₁ са
zh: 矩阵M中第 j?列中该值所在行对应 j?列的值

source: Hadamard product of matrices A and B
bg: Произведение на Адамар на матриците A и B
zh: 矩阵A和B的Hadamard积

source: Frobenius product of matrices A and B
bg: Произведение на Фробениус на матриците A и B
zh: 矩阵A和B的Frobenius积

source: Kronecker product of matrices A and B
bg: Произведение на Кронекер на матриците A и B
zh: 矩阵A和B的Kronecker积

source: L2 norm of matrix M
bg: L2 норма на матрицата M
zh: 矩阵A和B的L2Norm积

source: L1 norm of matrix M
bg: L1 норма на матрицата M
zh: 矩阵A和B的L1Norm积

source: Frobenius norm of matrix M
bg: Норма на Фробениус на матрицата M
zh: 矩阵A和B的Frobenius积

source: L∞ norm of matrix M
bg: L∞ норма на матрицата M
zh: 矩阵A和B的LNorm积

source: Condition number of M based on the L2 norm
bg: Число на обусловеност на M на базата на L2 нормата
zh: 矩阵A和B的Condition积

source: Condition number of M based on the L1 norm
bg: Число на обусловеност на M на базата на L1 нормата
zh: 矩阵A和B的Condition积

source: Condition number of M based on the Frobenius norm
bg: Число на обусловеност на M на базата на нормата на Фробениус
zh: 矩阵A和B的Condition积

source: Condition number of M based on the L∞ norm
bg: Число на обусловеност на M на базата на L∞ нормата
zh: 矩阵A和B的Condition积

source: Determinant of matrix M
bg: Детерминанта на матрицата M
zh: 矩阵M的行列式

source: Rank of matrix M
bg: Ранг на матрицата M
zh: 矩阵M的秩

source: Trace of matrix M
bg: Следа на матрица M
zh: 矩阵M的迹

source: Transpose of matrix M
bg: Транспонираната матрица на M
zh: 矩阵M的转置

source: Adjugate of matrix M
bg: Адюгираната матрица на M
zh: 矩阵M的伴随矩阵

source: Cofactor matrix of M
bg: Кофакторната матрица на M
zh: 矩阵M的协因数阵(伴随矩阵的转置)

source: Eigenvalues of matrix M
bg: Собствените стойности на матрицата M
zh: 矩阵M的特征值

source: Eigenvectors of matrix M
bg: Собствените вектори на матрицата M
zh: 矩阵M的特征向量

source: Eigenvalues and eigenvectors of matrix M
bg: Собствените стойности и вектори на матрица M
zh: 矩阵M的特征值和特征向量

source: Cholesky decomposition of a symmetric, positive-definite matrix M
bg: Декомпозиция на Холецки на симетричната, положително определена матрица M
zh: 对称-正定矩阵M的Cholesky分解

source: LU decomposition of matrix M
bg: LU декомпозиция на матрицата M
zh: 矩阵M的LU分解

source: QR decomposition of matrix M
bg: QR декомпозиция на матрицата M
zh: 矩阵M的QR分解

source: Singular value decomposition of M
bg: Декомпозиция по сингулярни стойности на матрица M
zh: 矩阵M的奇异值分解

source: Inverse of matrix M
bg: Обратната матрица на M
zh: 矩阵M的逆矩阵

source: Solves the system of linear equations Ax = b using LDLT decomposition for symmetric matrices, and LU for non-symmetric
bg: Решава линейното матрично уравнение Ax = b чрез LDLT декомпозиция за симетрични матрици и LU декомпозиция за несиметрични
zh: 分别用LDLT、LU分解求解系数阵A为对称阵、非对称阵的线性方程组AX=b

source: Solves the linear matrix equation Ax = b with a symmetric, positive-definite matrix A using Cholesky decomposition
bg: Решава линейното матрично уравнение Ax = b с положително определена матрица A чрез декомпозиция на Холецки
zh: 用Cholesky分解求解系数阵A为对称正定阵的线性矩阵方程AX=b

source: Returns the element of matrix M at indexes x and y
bg: Връща елемента на матрица M с индекси x и y
zh: 返回矩阵索引号为x和y的元素

source: Double linear interpolation from the elements of matrix M based on the values of x and y
bg: Двойна линейна интерполация от елементите на матрицата M на базата на стойностите на x и y
zh: 基于x和y的值以矩阵M的元素坐双双线性内插

source: Double Hermite spline interpolation from the elements of matrix M based on the values of x and y
bg: Двойна сплайн интерполация на Ермит от елементите на матрицата M на базата на стойностите на x и y
zh: 基于x和y的值以矩阵M的元素坐双Hermite样条曲线内插

source: Round to
bg: Закр.
zh: 舍入到

source: Solves the generalized matrix equation AX = B using LDLT decomposition for symmetric matrices and LU for non-symmetric
bg: Решава обобщеното матрично уравнение AX = B, използвайки LDLT декомпозиция за симетрични матрици и LU за несиметрични
zh: 分别用LDLT、LU分解求解系数阵A为对称阵、非对称阵的一般方程AX=B

source: Solves the generalized matrix equation AX = B with symmetric positive definite matrix A using Cholesky decomposition
bg: Решава обобщеното матрично уравнение AX = B със симетрична положително определена матрица A, използвайки декомпозиция на Холецки
zh: 用Cholesky分解求解系数阵A为对称正定阵的一般方程AX=B
