Repository: Proektsoftbg/Calcpad
Catalog: Calcpad.Wpf/UnitsResources.*.resx
Languages: bg

source: % (percent)
bg: % (процент)

source: ‰ (permille)
bg: ‰ (промил)

source: ° (degrees)
bg: ° (градус)

source: ′ (minutes)
bg: ′ (минута)

source: ″ (seconds)
bg: ″ (секунда)

source: deg (degrees)
bg: deg (градус)

# Radians
source: rad (radians)
bg: rad (радиан)

# Gradians
source: grad (gradians)
bg: grad (град)

# Revolutions
source: rev (revolutions)
bg: rev (оборот)

source: Angles
bg: Ъгли

# Units_Header
source: Units
bg: Мерни единици

source: Metric
bg: Метрични

source: Mass
bg: Маса

# Gram
source: g (gram)
bg: g (грам)

# Hectogram
source: hg (hectogram)
bg: hg (хектограм)

# Kilogram
source: kg (kilogram)
bg: kg (килограм)

# Ton
source: t (ton)
bg: t (тон)

# Kiloton
source: kt (kiloton)
bg: kt (килотон)

# Megaton
source: Mt (megaton)
bg: Mt (мегатон)

# Gigaton
source: Gt (gigaton)
bg: Gt (гигатон)

# Decigram
source: dg (decigram)
bg: dg (дециграм)

# Centigram
source: cg (centigram)
bg: cg (сантиграм)

# Milligram
source: mg (milligram)
bg: mg (милиграм)

# Microgram
source: μg (microgram)
bg: μg (микрограм)

# Nanogram
source: ng (nanogram)
bg: ng (нанограм)

# Picogram
source: pg (picogram)
bg: pg (пикограм)

# Dalton
source: Da (Dalton)
bg: Da (Далтон)

# DaltonAlt
source: u (Dalton alt.)
bg: u (Далтон алт.)

source: Length
bg: Дължина

# Meter
source: m (meter)
bg: m (метър)

# Kilometer
source: km (kilometer)
bg: km (километър)

# Decimeter
source: dm (decimeter)
bg: dm (дециметър)

# Centimeter
source: cm (centimeter)
bg: cm (сантиметър)

# Millimeter
source: mm (millimeter)
bg: mm (милиметър)

# Micrometer
source: μm (micrometer)
bg: μm (микрометър)

# Nanometer
source: nm (nanometer)
bg: nm (нанометър)

# Picometer
source: pm (picometer)
bg: pm (пикометър)

# AstronomicalUnit
source: AU (astronomical unit)
bg: AU (астрономическа единица)

# LightYear
source: ly (light year)
bg: ly (светлинна година)

source: Area
bg: Площ

# SqMeter
source: m² (sq. meter)
bg: m² (кв. метър)

# SqKilometer
source: km² (sq. kilometer)
bg: km² (кв. километър)

# SqDecimeter
source: dm² (sq. decimeter)
bg: dm² (кв. дециметър)

# SqCentimeter
source: cm² (sq. centimeter)
bg: cm² (кв. сантиметър)

# SqMillimeter
source: mm² (sq. millimeter)
bg: mm² (кв. милиметър)

# Are
source: a (are)
bg: a (ар)

# Decare
source: daa (decare)
bg: daa (декар)

# Hectare
source: ha (hectare)
bg: ha (хектар)

source: Volume
bg: Обем

# CubicMeter
source: m³ (cubic meter)
bg: m³ (кубичен метър)

# CubicKilometer
source: km³ (cubic kilometer)
bg: km³ (кубичен километър)

# CubicDecimeter
source: dm³ (cubic decimeter)
bg: dm³ (кубичен дециметър)

# CubicCentimeter
source: cm³ (cubic centimeter)
bg: cm³ (кубичен сантиметър)

# CubicMillimeter
source: mm³ (cubic millimeter)
bg: mm³ (кубичен милиметър)

# Litre
source: L (litre)
bg: L (литър)

# Decalitre
source: daL (decalitre)
bg: daL (декалитър)

# Hectolitre
source: hL (hectolitre)
bg: hL (хектолитър)

# Decilitre
source: dL (decilitre)
bg: dL (децилитър)

# Centilitre
source: cL (centilitre)
bg: cL (сантилитър)

# Millilitre
source: mL (millilitre)
bg: mL (милилитър)

# Microlitre
source: μL (microlitre)
bg: μL (микролитър)

# Nanolitre
source: nL (nanolitre)
bg: nL (нанолитър)

# Picolitre
source: pL (picolitre)
bg: pL (пиколитър)

source: Time
bg: Време

# Second
source: s (second)
bg: s (секунда)

# Millisecond
source: ms (millisecond)
bg: ms (милисекунда)

# Microsecond
source: μs (microsecond)
bg: μs (микросекунда)

# Nanosecond
source: ns (nanosecond)
bg: ns (наносекунда)

# Picosecond
source: ps (picosecond)
bg: ps (пикосекунда)

# Minute
source: min (minute)
bg: min (минута)

# Hour
source: h (hour)
bg: h (час)

# Day
source: d (day)
bg: d (ден)

# Week
source: w (week)
bg: w (седмица)

# Year
source: y (year)
bg: y (година)

source: Frequency
bg: Честота

# Hertz
source: Hz (Hertz)
bg: Hz (Херц)

# Kilohertz
source: kHz (kilohertz)
bg: kHz (килохерц)

# Megahertz
source: MHz (megahertz)
bg: MHz (мегахерц)

# Gigahertz
source: GHz (gigahertz)
bg: GHz (гигахерц)

# Terahertz
source: THz (terahertz)
bg: THz (терахерц)

# Millihertz
source: mHz (millihertz)
bg: mHz (милихерц)

# Microhertz
source: μHz (microhertz)
bg: μHz (микрохерц)

# Nanohertz
source: nHz (nanohertz)
bg: nHz (нанохерц)

# Picohertz
source: pHz (picohertz)
bg: pHz (пикохерц)

# RPM
source: rpm (rotations per minute)
bg: rpm (оборота в минута)

source: Speed
bg: Скорост

# MetersPerSecond
source: m/s (meters per second)
bg: m/s (метра в секунда)

# KilometersPerHour
source: kmh (kilometers per hour)
bg: kmh (километра в час)

source: Temperature
bg: Температура

# DegreeCelsius
source: °C (degree Celsius)
bg: °C (градус Целзий)

# DifferenceInDegreesCelsius
source: Δ°C (difference in °C)
bg: Δ°C (разлика в градуси Целзий)

# Kelvin
source: K (Kelvin)
bg: K (Келвин)

source: Force
bg: Сила

# Newton
source: N (Newton)
bg: N (Нютон)

# Decanewton
source: daN (decanewton)
bg: daN (деканютон)

# Hectonewton
source: hN (hectonewton)
bg: hN (хектонютон)

# Kilonewton
source: kN (kilonewton)
bg: kN (килонютон)

# Meganewton
source: MN (meganewton)
bg: MN (меганютон)

# Giganewton
source: GN (giganewton)
bg: GN (гиганютон)

# Teranewton
source: TN (teranewton)
bg: TN (теранютон)

# GramForce
source: gf (gram-force)
bg: gf (грам-сила)

# KilogramForce
source: kgf (kilogram-force)
bg: kgf (килограм-сила)

# TonneForce
source: tf (tonne-force)
bg: tf (тон-сила)

# Dyne
source: dyn (dyne)
bg: dyn (дин)

source: Torque/Moment
bg: Усукване/Момент

# NewtonMeter
source: Nm (Newton-meter)
bg: Nm (Нютон-метър)

# NewtonMillimeter
source: N·mm (Newton-millimeter)
bg: N·mm (Нютон-милиметър)

# KiloNewtonCentimeter
source: kN·cm (kilonewton-centimeter)
bg: kN·cm (килонютон-сантиметър)

# KiloNewtonMeter
source: kNm (kilonewton-meter)
bg: kNm (килонютон-метър)

# NewtonCentimeter
source: N·cm (Newton-centimeter)
bg: N·cm (Нютон-сантиметър)

source: Pressure
bg: Налягане

# NewtonsPerSqMillimeter
source: N/mm² (Newton per sq. mm)
bg: N/mm² (Нютон на mm)

# NewtonsPerSqCentimeter
source: N/cm² (Newton per sq. cm)
bg: N/cm² (Нютон на cm)

# NewtonsPerSqMeter
source: N/m² (Newton per sq. meter)
bg: N/m² (Нютон на кв. метър)

# KiloNewtonsPerSqCentimeter
source: kN/cm² (kN per sq. cm)
bg: kN/cm² (kN на кв. cm)

# KiloNewtonsPerSqMeter
source: kN/m² (kN per sq. meter)
bg: kN/m² (kN на кв. метър)

# KilogramFrocePerSqCentimeter
source: kgf/cm² (kg-force per sq. cm)
bg: kgf/cm² (kg-сила на кв. cm)

# TonneForcePerSqMeter
source: tf/m² (tonne-force per sq. meter)
bg: tf/m² (тон-сила на кв. метър)

# Pascal
source: Pa (Pascal)
bg: Pa (Паскал)

# Decapascal
source: daPa (decapascal)
bg: daPa (декапаскал)

# Hectopascal
source: hPa (hectopascal)
bg: hPa (хектопаскал)

# Kilopascal
source: kPa (kilopascal)
bg: kPa (килопаскал)

# Megapascal
source: MPa (megapascal)
bg: MPa (мегапаскал)

# Gigapascal
source: GPa (gigapascal)
bg: GPa (гигапаскал)

# Terapascal
source: TPa (terapascal)
bg: TPa (терапаскал)

# Decipascal
source: dPa (decipascal)
bg: dPa (деципаскал)

# Centipascal
source: cPa (centipascal)
bg: cPa (сантипаскал)

# Millipascal
source: mPa (millipascal)
bg: mPa (милипаскал)

# Micropascal
source: μPa (micropascal)
bg: μPa (микропаскал)

# Nanopascal
source: nPa (nanopascal)
bg: nPa (нанопаскал)

# Picopascal
source: pPa (picopascal)
bg: pPa (пикопаскал)

# Bar
source: bar (bar)
bg: bar (бар)

# Millibar
source: mbar (millibar)
bg: mbar (милибар)

# Microbar
source: μbar (microbar)
bg: μbar (микробар)

# Atmosphere
source: atm (atmosphere)
bg: atm (атмосфера)

# TechnicalAtmosphere
source: at (technical atmosphere)
bg: at (техническа атмосфера)

# Torr
source: Torr (Torr)
bg: Torr (Тор)

# MillilitersOfMercury
source: mmHg (millimeters of mercury)
bg: mmHg (милиметра живачен стълб)

source: Density/Unit weight
bg: Плътност/обемно тегло

# GramsPerCubicCentimeter
source: g/cm³ (gram per cubic cm)
bg: g/cm³ (грам на кубичен cm)

# GramsPerCubicMillimeter
source: g/mm³ (gram per cubic mm)
bg: g/mm³ (грам на кубичен mm)

# KilogramsPerCubicCentimeter
source: kg/cm³ (kilogram per cubic cm)
bg: kg/cm³ (килограм на кубичен cm)

# TonnesPerCubicMeter
source: t/m³ (tonne per cubic meter)
bg: t/m³ (тон на кубичен метър)

# KilogramForcePerCubicCentimeter
source: kgf/cm³ (kg-force per cubic cm)
bg: kgf/cm³ (kg-сила на кубичен cm)

# TonneForcePerCubicMeter
source: tf/m³ (tonne-force per cubic meter)
bg: tf/m³ (тон-сила на кубичен метър)

# NewtonsPerCubicMillimeter
source: N/mm³ (Newton per cubic mm)
bg: N/mm³ (Нютон на кубичен mm)

# NewtonsPerCubicCentimeter
source: N/cm³ (Newton per cubic cm)
bg: N/cm³ (Нютон на кубичен cm)

# KilonewtonsPerCubicCentimeter
source: kN/cm³ (kilonewton per cubic cm)
bg: kN/cm³ (килонютон на кубичен cm)

# KilonewtonsPerCubicMeter
source: kN/m³ (kilonewton per cubic m)
bg: kN/m³ (килонютон на кубичен метър)

source: Viscosity
bg: Вискозитет

# PascalSecond
source: Pa∙s (Pascal-second)
bg: Pa∙s (Паскал-секунда)

# Poise
source: P (Poise)
bg: P (Поаз)

# Centipoise
source: cP (centipoise)
bg: cP (сантипоаз)

# SquareMetersPerSecond
source: m²/s (square meters per second)
bg: m²/s (квадратни метра в секунда)

# Stokes
source: St (Stokes)
bg: St (Стокс)

# Centistokes
source: cSt (centistokes)
bg: cSt (сантистокс)

source: Energy/Work
bg: Енергия/работа

# Joule
source: J (Joule)
bg: J (Джаул)

# Kilojoule
source: kJ (kilojoule)
bg: kJ (килоджаул)

# Megajoule
source: MJ (megajoule)
bg: MJ (мегаджаул)

# Gigajoule
source: GJ (gigajoule)
bg: GJ (гигаджаул)

# Terajoule
source: TJ (terajoule)
bg: TJ (тераджаул)

# Millijoule
source: mJ (millijoule)
bg: mJ (милиджаул)

# Microjoule
source: μJ (microjoule)
bg: μJ (микроджаул)

# Nanojoule
source: nJ (nanojoule)
bg: nJ (наноджаул)

# Picojoule
source: pJ (picojoule)
bg: pJ (пикоджаул)

# Electronvolt
source: eV (electronvolt)
bg: eV (електронволт)

# Kiloelectronvolt
source: keV (kiloelectronvolt)
bg: keV (килоелектронволт)

# Megaelectronvolt
source: MeV (megaelectronvolt)
bg: MeV (мегаелектронволт)

# Gigaelectronvolt
source: GeV (gigaelectronvolt)
bg: GeV (гигаелектронволт)

# Teraelectronvolt
source: TeV (teraelectronvolt)
bg: TeV (тераелектронволт)

# Petaelectronvolt
source: PeV (petaelectronvolt)
bg: PeV (петаелектронволт)

# Exaelectronvolt
source: EeV (exaelectronvolt)
bg: EeV (екзаелектронволт)

# Erg
source: erg (erg)
bg: erg (ерг)

# Calorie
source: cal (calorie)
bg: cal (калория)

# Kilocalorie
source: kcal (kilocalorie)
bg: kcal (килокалория)

source: Power
bg: Мощност

# Watt
source: W (Watt)
bg: W (Ват)

# Kilowatt
source: kW (kilowatt)
bg: kW (киловат)

# Megawatt
source: MW (megawatt)
bg: MW (мегават)

# Gigawatt
source: GW (gigawatt)
bg: GW (гигават)

# Terawatt
source: TW (terawatt)
bg: TW (терават)

# Milliwatt
source: mW (milliwatt)
bg: mW (миливат)

# Microwatt
source: μW (microwatt)
bg: μW (микроват)

# Nanowatt
source: nW (nanowatt)
bg: nW (нановат)

# Picowatt
source: pW (picowatt)
bg: pW (пиковат)

source: Electric
bg: Електрически

source: Charge
bg: Заряд

# Ampere
source: A (Ampere)
bg: A (Ампер)

source: Energy
bg: Енергия

source: Current
bg: Поток

# Kiloampere
source: kA (kiloampere)
bg: kA (килоампер)

# Megaampere
source: MA (megaampere)
bg: MA (мегаампер)

# Gigaampere
source: GA (gigaampere)
bg: GA (гигаампер)

# Teraampere
source: TA (teraampere)
bg: TA (тераампер)

# Milliampere
source: mA (milliampere)
bg: mA (милиампер)

# Microampere
source: μA (microampere)
bg: μA (микроампер)

# Nanoampere
source: nA (nanoampere)
bg: nA (наноампер)

# Picoampere
source: pA (picoampere)
bg: pA (пикоампер)

# Coulomb
source: C (Coulomb)
bg: C (Кулон)

# Kilocoulomb
source: kC (kilocoulomb)
bg: kC (килокулон)

# Megacoulomb
source: MC (megacoulomb)
bg: MC (мегакулон)

# Gigacoulomb
source: GC (gigacoulomb)
bg: GC (гигакулон)

# Teracoulomb
source: TC (teracoulomb)
bg: TC (теракулон)

# Millicoulomb
source: mC (millicoulomb)
bg: mC (миликулон)

# Microcoulomb
source: μC (microcoulomb)
bg: μC (микрокулон)

# Nanocoulomb
source: nC (nanocoulomb)
bg: nC (нанокулон)

# Picocoulomb
source: pC (picocoulomb)
bg: pC (пикокулон)

# AmpereHour
source: Ah (Ampere-hour)
bg: Ah (ампер-час)

# MillampereHour
source: mAh (milliampere-hour)
bg: mAh (милиампер-час)

source: Potential
bg: Потенциал

# Volt
source: V (Volt)
bg: V (Волт)

# Kilovolt
source: kV (kilovolt)
bg: kV (киловолт)

# Megavolt
source: MV (megavolt)
bg: MV (мегаволт)

# Gigavolt
source: GV (gigavolt)
bg: GV (гигаволт)

# Teravolt
source: TV (teravolt)
bg: TV (тераволт)

# Millivolt
source: mV (millivolt)
bg: mV (миливолт)

# Microvolt
source: μV (microvolt)
bg: μV (микроволт)

# Nanovolt
source: nV (nanovolt)
bg: nV (нановолт)

# Picovolt
source: pV (picovolt)
bg: pV (пиковолт)

source: Capacitance
bg: Капацитет

# Farad
source: F (Farad)
bg: F (Фарад)

# Kilofarad
source: kF (kilofarad)
bg: kF (килофарад)

# Microfarad
source: μF (microfarad)
bg: μF (микрофарад)

# Megafarad
source: MF (megafarad)
bg: MF (мегафарад)

# Gigafarad
source: GF (gigafarad)
bg: GF (гигафарад)

# Terafarad
source: TF (terafarad)
bg: TF (терафарад)

# Millifarad
source: mF (millifarad)
bg: mF (милифарад)

# Nanofarad
source: nF (nanofarad)
bg: nF (нанофарад)

# Picofarad
source: pF (picofarad)
bg: pF (пикофарад)

source: Resistance
bg: Съпротивление

# Ohm
source: Ω (Ohm)
bg: Ω (Ом)

# Kiloohm
source: kΩ (kiloohm)
bg: kΩ (килоом)

# Megaohm
source: MΩ (megaohm)
bg: MΩ (мегаом)

# Gigaohm
source: GΩ (gigaohm)
bg: GΩ (гигаом)

# Teraohm
source: TΩ (teraohm)
bg: TΩ (тераом)

# Milliohm
source: mΩ (milliohm)
bg: mΩ (милиом)

# Microohm
source: μΩ (microohm)
bg: μΩ (микроом)

# Nanoohm
source: nΩ (nanoohm)
bg: nΩ (наноом)

# Picoohm
source: pΩ (picoohm)
bg: pΩ (пикоом)

source: Conductance
bg: Проводимост

# Siemens
source: S (Siemens)
bg: S (Сименс)

# Kilosiemens
source: kS (kilosiemens)
bg: kS (килосименс)

# Megasiemens
source: MS (megasiemens)
bg: MS (мегасименс)

# Gigasiemens
source: GS (gigasiemens)
bg: GS (гигасименс)

# Terasiemens
source: TS (terasiemens)
bg: TS (терасименс)

# Millisiemens
source: mS (millisiemens)
bg: mS (милисименс)

# Microsiemens
source: μS (microsiemens)
bg: μS (микросименс)

# Nanosiemens
source: nS (nanosiemens)
bg: nS (наносименс)

# Picosiemens
source: pS (picosiemens)
bg: pS (пикосименс)

source: ℧ (mho)
bg: ℧ (мо)

# Kilomho
source: k℧ (kilomho)
bg: k℧ (киломо)

# Megamho
source: M℧ (megamho)
bg: M℧ (мегамо)

# Gigamho
source: G℧ (gigamho)
bg: G℧ (гигамо)

# Teramho
source: T℧ (teramho)
bg: T℧ (терамо)

# Millimho
source: m℧ (millimho)
bg: m℧ (милимо)

# Micromho
source: μ℧ (micromho)
bg: μ℧ (микромо)

# Nanomho
source: n℧ (nanomho)
bg: n℧ (наномо)

# Picomho
source: p℧ (picomho)
bg: p℧ (пикомо)

# WattHour
source: Wh (Watt-hour)
bg: Wh (Ват-час)

# KilowattHour
source: kWh (kilowatt-hour)
bg: kWh (киловат-час)

# MegawattHour
source: MWh (megawatt-hour)
bg: MWh (мегават-час)

# GigawattHour
source: GWh (gigawatt-hour)
bg: GWh (гигават-час)

# TerawattHour
source: TWh (terawatt-hour)
bg: TWh (терават-час)

# MilliwattHour
source: mWh (milliwatt-hour)
bg: mWh (миливат-час)

# MicrowattHour
source: μWh (microwatt-hour)
bg: μWh (микроват-час)

# NanowattHour
source: nWh (nanowatt-hour)
bg: nWh (нановат-час)

# PicowattHour
source: pWh (picowatt-hour)
bg: pWh (пиковат-час)

# VoltAmpere
source: VA (Volt-Ampere)
bg: VA (Волт-Ампер)

# KilovoltAmpere
source: kVA (kilovolt-Ampere)
bg: kVA (киловолт-Ампер)

# MegavoltAmpere
source: MVA (megavolt-Ampere)
bg: MVA (мегаволт-Ампер)

# GigavoltAmpere
source: GVA (gigavolt-Ampere)
bg: GVA (гигаволт-Ампер)

# TeravoltAmpere
source: TVA (teravolt-Ampere)
bg: TVA (тераволт-Ампер)

# MillivoltAmpere
source: mVA (millivolt-Ampere)
bg: mVA (миливолт-Ампер)

# MicrovoltAmpere
source: μVA (microvolt-Ampere)
bg: μVA (микроволт-Ампер)

# NanovoltAmpere
source: nVA (nanovolt-Ampere)
bg: nVA (нановолт-Ампер)

# PicovoltAmpere
source: pVA (picovolt-Ampere)
bg: pVA (пиковолт-Ампер)

# VoltAmpereReactive
source: VAR (Volt-Ampere (reactive))
bg: VAR (волт-Ампер (реактивна))

# KilovoltAmpereReactive
source: kVAR (kilovolt-Ampere-reactive)
bg: kVAR (киловолт-Ампер реактивна)

# MegavoltAmpereReactive
source: MVAR (megavolt-Ampere-reactive)
bg: MVAR (мегаволт-Ампер реактивна)

# GigavoltAmpereReactive
source: GVAR (gigavolt-Ampere-reactive)
bg: GVAR (гигаволт-Ампер реактивна)

# TeravoltAmpereReactive
source: TVAR (teravolt-Ampere-reactive)
bg: TVAR (тераволт-Ампер реактивна)

# MillivoltAmpereReactive
source: mVAR (millivolt-Ampere-reactive)
bg: mVAR (миливолт-Ампер реактивна)

# MicrovoltAmpereReactive
source: μVAR (microvolt-Ampere-reactive)
bg: μVAR (микроволт-Ампер реактивна)

# NanovoltAmpereReactive
source: nVAR (nanovolt-Ampere-reactive)
bg: nVAR (нановолт-Ампер реактивна)

# PicovoltAmpereReactive
source: pVAR (picovolt-Ampere-reactive)
bg: pVAR (пиковолт-Ампер реактивна)

source: Electric Field
bg: Електрическо поле

# VoltsPerMeter
source: V/m (Volts per meter)
bg: V/m (Волт на метър)

# VoltMeter
source: V∙m (Volt-meter)
bg: V∙m (Волт-метър)

# NewtonsPerCoulomb
source: N/C (Newtons per Coulomb)
bg: N/C (Нютон на Кулон)

# OhmMeter
source: Ω∙m (Ohm-meter)
bg: Ω∙m (Ом-метър)

# SiemensPerMeter
source: S/m (Siemens per meter)
bg: S/m (Сименс на метър)

# Weber
source: Wb (Weber)
bg: Wb (Вебер)

# Kiloweber
source: kWb (kiloweber)
bg: kWb (киловебер)

# Megaweber
source: MWb (megaweber)
bg: MWb (мегавебер)

# Gigaweber
source: GWb (gigaweber)
bg: GWb (гигавебер)

# Teraweber
source: TWb (teraweber)
bg: TWb (теравебер)

# Milliweber
source: mWb (milliweber)
bg: mWb (миливебер)

# Microweber
source: μWb (microweber)
bg: μWb (микровебер)

# Nanoweber
source: nWb (nanoweber)
bg: nWb (нановебер)

# Picoweber
source: pWb (picoweber)
bg: pWb (пиковебер)

source: Magnetic
bg: Магнитни

source: Flux
bg: Поток

source: Flux Density
bg: Плътност на потока

# Tesla
source: T (Tesla)
bg: T (Тесла)

# Kilotesla
source: kT (kilotesla)
bg: kT (килотесла)

# Megatesla
source: MT (megatesla)
bg: MT (мегатесла)

# Gigatesla
source: GT (gigatesla)
bg: GT (гигатесла)

# Teratesla
source: TT (teratesla)
bg: TT (тератесла)

# Millitesla
source: mT (millitesla)
bg: mT (милитесла)

# Microtesla
source: μT (microtesla)
bg: μT (микротесла)

# Nanotesla
source: nT (nanotesla)
bg: nT (нанотесла)

# Picotesla
source: pT (picotesla)
bg: pT (пикотесла)

source: Inductance
bg: Индукция

# Henry
source: H (Henry)
bg: H (Хенри)

# Kilohenry
source: kH (kilohenry)
bg: kH (килохенри)

# Megahenry
source: MH (megahenry)
bg: MH (мегахенри)

# Gigahenry
source: GH (gigahenry)
bg: GH (гигахенри)

# Terahenry
source: TH (terahenry)
bg: TH (терахенри)

# Millihenry
source: mH (millihenry)
bg: mH (милихенри)

# Microhenry
source: μH (microhenry)
bg: μH (микрохенри)

# Nanohenry
source: nH (nanohenry)
bg: nH (нанохенри)

# Picohenry
source: pH (picohenry)
bg: pH (пикохенри)

source: Light/Radiation
bg: Осветеност/излъчване

# LumenSecondPerCubicMeter
source: lm·s/m³ (lumen-second per m³)
bg: lm·s/m³ (лумен-секунда на m³)

# LumenPerWatt
source: lm/W (lumen per Watt)
bg: lm/W (лумена на Ват)

# CandelaPerSqMeter
source: cd/m² (candela per sq. meter)
bg: cd/m² (кандела на кв. метър)

# Lumen
source: lm (lumen)
bg: lm (лумен)

# LumenSecond
source: lm·s (lumen-second)
bg: lm·s (лумен-секунда)

# Candela
source: cd (candela)
bg: cd (кандела)

# Lux
source: lx (lux)
bg: lx (лукс)

# LuxSecond
source: lx·s (lux-second)
bg: lx·s (лукс-секунда)

source: Radioactivity
bg: Радиоактивност

# Becquerel
source: Bq (Becquerel)
bg: Bq (Бекерел)

# Kilobecquerel
source: kBq (kilobecquerel)
bg: kBq (килобекерел)

# Megabecquerel
source: MBq (megabecquerel)
bg: MBq (мегабекерел)

# Gigabecquerel
source: GBq (gigabecquerel)
bg: GBq (гигабекерел)

# Terabecquerel
source: TBq (terabecquerel)
bg: TBq (терабекерел)

# Millibecquerel
source: mBq (millibecquerel)
bg: mBq (милибекерел)

# Microbecquerel
source: μBq (microbecquerel)
bg: μBq (микробекерел)

# Nanobecquerel
source: nBq (nanobecquerel)
bg: nBq (нанобекерел)

# Picobecquerel
source: pBq (picobecquerel)
bg: pBq (пикобекерел)

# Curie
source: Ci (Curie)
bg: Ci (Кюри)

# Rutherford
source: Rd (Rutherford)
bg: Rd (Ръдърфорд)

source: Exposure
bg: Експозиция

source: Absorbed Dose
bg: Погълната доза

# Roentgen
source: R (Röntgen)
bg: R (Рентген)

# CoulombPerKilogram
source: C/kg (Coulomb per kg)
bg: C/kg (Кулон на килограм)

# Gray
source: Gy (Gray)
bg: Gy (Грей)

# Kilogray
source: kGy (kilogray)
bg: kGy (килогрей)

# Megagray
source: MGy (megagray)
bg: MGy (мегагрей)

# Gigagray
source: GGy (gigagray)
bg: GGy (гигагрей)

# Teragray
source: TGy (teragray)
bg: TGy (терагрей)

# Milligray
source: mGy (milligray)
bg: mGy (милигрей)

# Microgray
source: μGy (microgray)
bg: μGy (микрогрей)

# Nanogray
source: nGy (nanogray)
bg: nGy (наногрей)

# Picogray
source: pGy (picogray)
bg: pGy (пикогрей)

source: Equivalent Dose
bg: Еквивалентна доза

# Sievert
source: Sv (Sievert)
bg: Sv (Сиверт)

# Kilosievert
source: kSv (kilosievert)
bg: kSv (килосиверт)

# Megasievert
source: MSv (megasievert)
bg: MSv (мегасиверт)

# Gigasievert
source: GSv (gigasievert)
bg: GSv (гигасиверт)

# Terasievert
source: TSv (terasievert)
bg: TSv (терасиверт)

# Millisievert
source: mSv (millisievert)
bg: mSv (милисиверт)

# Microsievert
source: μSv (microsievert)
bg: μSv (микросиверт)

# Nanosievert
source: nSv (nanosievert)
bg: nSv (наносиверт)

# Picosievert
source: pSv (picosievert)
bg: pSv (пикосиверт)

# Mol
source: mol (amount of substance)
bg: mol (количество вещество)

# CatalyticActivity
source: kat (catalytic activity)
bg: kat (активност на катализатор)

source: Luminous intensity
bg: Интензитет на светлината

source: Luminous flux
bg: Светлинен поток

source: Luminous energy
bg: Светлинна енергия

source: Luminous energy density
bg: Плътност на светлинната енергия

source: Luminous efficacy
bg: Светлинна ефективност

source: Luminance
bg: Яркост

source: Illuminance
bg: Осветеност

source: Luminous exposure
bg: Светлинна експозиция

source: Dimensionless
bg: Бездименсионни
