Repository: Proektsoftbg/Calcpad
Catalog: Calcpad.Cli/Messages.*.resx
Languages: bg, zh

# Welcome_To_Calcpad_Command_Line_Interpreter
source: Welcome to Calcpad VM command line interpreter v.{0}.{1}.{2}!
bg: Добре дошли в командния интерпретатор на Calcpad VM {0}.{1}.{2}!
zh: 欢迎使用Calcpad命令行解释器v.{0}.{1}.{2}!

source: Press any key when ready.
bg: Натиснете произволен клавиш за да продължите.
zh: 准备好后按任意键！

# Copyright_2023_By_Proektsoft_EOOD
source: Copyright: © 2024 by Proektsoft EOOD.
bg: © 2025 Проектсофт ЕООД. Всички права запазени.
zh: 版权所有： © 2023 by Proektsoft EOOD

source: Commands
bg: Команди
zh: 命令

source: Enter math expressions or commands (or type HELP for further instructions)
bg: Въведете аритметичен израз или команда (HELP за допълнителни инструкции)
zh: 输入数学表达式或命令（或键入帮助以获取进一步说明）

source: Error
bg: Грешка
zh: 错误！

source: There are no saved problems.
bg: Няма записани задачи.
zh: 没有已保存的问题！

source: Problem title:
bg: Име на задачата:
zh: 问题标题:

source: Problem \"{0}\" does not exist.
bg: Не съществува задача \"{0}\".
zh: 问题\"{0}\"不存在！

source: Loading the settings file...
bg: Отваряне на файл с настройки...
zh: 正在加载设置文件...

source: Would you like to restore the previous settings (y/n)?
bg: Желаете ли да възстановите предишните настройки (да/не)?

source: Press any key to continue.
bg: Натиснете произволен клавиш, за да продължите.

source: Invalid input file extension. Must be 'cpd' or 'txt'.
bg: Невалидно разширение на входния файл. Трябва да е 'cpd' или 'txt'.

source: Input file does not exist.
bg: Входният файл не съществува.

source: Invalid output extension.. Must be 'html', 'docx' or 'pdf'.
bg: Невалидно изходно разширение.. Трябва да е 'html', 'docx' или 'pdf'.
