Repository: Proektsoftbg/Calcpad
Catalog: Calcpad.Core/Messages.*.resx
Languages: bg, zh

source: Invalid syntax: "{0}".
bg: Невалиден синтаксис: "{0}".
zh: 无效的语法: "{0}".

source: Incomplete expression.
bg: Непълен израз.
zh: 表达式不完整.

source: Missing left bracket "(".
bg: Липсва лява скоба "(".
zh: 缺少左括号 "(".

source: Missing right bracket ")".
bg: Липсва дясна скоба ")".
zh: 缺少右括号 ")".

source: Invalid symbol: "{0}".
bg: Невалиден символ: "{0}".
zh: 无效符号： "{0}".

source: Invalid units: "{0}".
bg: Невалидни мерни единици: "{0}".
zh: 无效单位： "{0}".

source: Cannot evaluate "{0}" as {1}.
bg: Не мога да изчисля "{0}" като {1}.
zh: 无法将 "{0}" 计算为 {1}.

source: Invalid operator: "{0}".
bg: Невалиден оператор: "{0}".
zh: 无效的运算操作: "{0}" .

source: Power must be unitless.
bg: Степенният показател трябва да е бездименсионен.
zh: 指数必须是无单位的.

source: The expression on the right does not evaluate to units.
bg: Изразът отдясно не се изчислява до мерни единици.
zh: 右侧的表达式不带单位.

# Cannot_evaluate_the_function_f_for_v_equals__0__
source: Cannot evaluate the function %F for %V = {0}.
bg: Не мога да изчисля функцията %F за %V = {0}.
zh: 对于 %V = {0} ，无法计算函数 %F.

# The_function_f_is_not_defined_for_v_equals__0__
source: The function %F is not defined for %V = {0}.
bg: Функцията %F не е дефинирана за %V = {0}.
zh: 函数 %F 在%V = {0} 处无定义.

source: Inconsistent units: "{0}" and "{1}".
bg: Несъвместими мерни единици: "{0}" и "{1}".
zh: 单位不一致： "{0}" 和 "{1}".

source: Limits out of range: [{0}; {1}].
bg: Границите са извън допустимите: [{0}; {1}].
zh: 限值超出范围： [{0}; {1}].

source: Invalid units for function: "{0}({1})".
bg: Невалидни мерни единици за функция: "{0}({1})".
zh: 函数 "{0}({1})" 的单位无效.

source: Root index must be unitless.
bg: Коренният показател трябва да е бездименсионен.
zh: 根索引号必须是无单位的.

source: Root index cannot be a complex number.
bg: Коренният показател не може да е комплексно число.
zh: 根索引号不能是复数.

# Root_index_must_be_integer_more_than_1
source: Root index must be an integer > 1.
bg: Коренният показател трябва да е цяло число > 1.
zh: 根索引必须是大于1的整数.

# Argument_out_of_range_for_n_factorial
source: Argument out of range for n!.
bg: Аргументът e извън допустимите стойности n! .
zh: n! 的参数超出范围.

# The_argument_of_n_factorial_must_be_unitless
source: The argument of n! must be unitless.
bg: Аргументът на n! трябва да е бездименсионен.
zh: n!的参数必须是无单位的.

# The_argument_of_n_factorial_must_be_a_positive_integer
source: The argument of n! must be a positive integer.
bg: Аргументът на n! трябва да е цяло положително число.
zh: n!的参数必须是正整数.

# The_argument_of_n_factorial_cannot_be_complex
source: The argument of n! cannot be complex.
bg: Аргументът на n! не може да е комплексно число.
zh: n!的参数不能是复数.

source: Both values must be integers.
bg: Двете стойности трябва да са цели числа.
zh: 两个值都必须是整数.

source: Variable '{0}' does not exist.
bg: Недифинирана променлива '{0}'.
zh: 变量 '{0}' 不存在.

source: Unit '{0}' does not exist.
bg: Недифинирани мерни единици '{0}'.
zh: 单位 '{0}' 不存在.

source: Interrupted by user.
bg: Прекъсване от потребителя.
zh: 被用户打断.

source: Calculations not active.
bg: Изчислителното ядро не е активно.
zh: 计算未激活.

source: Expression is empty.
bg: Изразът е празен.
zh: 表达式为空.

source: Missing operand.
bg: Липсва операнд.
zh: 缺少操作数.

source: Invalid function: "{0}".
bg: Невалидна функция: "{0}".
zh: 无效函数： "{0}".

source: Stack memory leak. Invalid expression.
bg: Неосвободена памет в стека. Невалиден израз.
zh: 堆栈内存泄漏.表达式无效.

source: Stack empty. Invalid expression.
bg: Стекът е празен. Невалиден израз.
zh: 堆栈为空.表达式无效.

source: Undefined input field.
bg: Недефинирано поле за въвеждане.
zh: 未定义的输入字段.

source: Undefined variable or units: "{0}".
bg: Недефинирана променлива или мерни единици: "{0}".
zh: 未定义的变量或单位： "{0}".

source: Error evaluating "{0}" as function.
bg: Грешка при изчисляване на "{0}" като функция.
zh: 将 "{0}" 作为函数计算时出错.

source: Error evaluating "{0}" as function or operator.
bg: Грешка при изчисляване на "{0}" като функция или оператор.
zh: 将 "{0}" 作为函数或运算符计算时出错.

source: Cannot rewrite existing units: {0}.
bg: Не мога да презапиша съществуващи единици: {0}.
zh: 无法重写现有单位： {0}.

source: The calculated units "{0}" are inconsistent with the target units "{1}".
bg: Получените мерни единици "{0}" не съответстват на отправните "{1}".
zh: 计算单位 "{0}" 与目标单位 "{1}" 不一致.

# InvalidCharacterException
source: Invalid character: '{0}'. Variables, functions and units must begin with a letter or ∡, except for the following units: ° ′ ″ % ‰.
bg: Невалиден символ: '{0}'. Имената на променливи, функции и мерни единици трябва да започват с буква или ∡, освен единиците: ° ′ ″ % ‰.
zh: 无效字符： '{0}' .变量、函数和单位必须以字母或?开头，以下单位除外： ° ′ ″ % ‰.

# Improper_use_of_the_assignment_operator_equals
source: Improper use of the assignment operator '='.
bg: Неправилно използване на оператора за присвояване '='.
zh: 赋值运算符 '=' 使用不正确.

source: Missing left bracket '{' in solver command.
bg: Липсва лява фигурна скоба '{' в команда за числени методи.
zh: 求解命令中缺少左括号 '{'.

source: Missing right bracket '}' in solver command.
bg: Липсва дясна фигурна скоба '}' в команда за числени методи.
zh: 求解命令中缺少右括号 '}'.

source: Invalid macro identifier: "{0}$".
bg: Невалидeн идентификатор на макро "{0}$".
zh: 无效的宏标识符： "{0}$".

source: Invalid solver command definition "{0}".
bg: Невалидна дефиниция на команда за числени методи "{0}".
zh: 无效的求解命令定义 "{0}".

source: Error parsing "{0}" as units.
bg: Грешка при опит за разпознаване на "{0}" като мерни единици.
zh: 将 "{0}" 解析为单位时出错.

source: Error parsing "{0}" as number.
bg: Грешка при опит за разпознаване на "{0}" като число.
zh: 将 "{0}" 解析为数时出错.

source: Missing delimiter "{0}" in solver command {{1}}.
bg: Липсва разделител "{0}" в команда за числени методи {{1}}.
zh: 求解命令 {{1}} 中缺少分隔符 "{0}".

# More_than_one_operator_equals_in__0__
source: More than one operators '=' in '{0}'.
bg: Повече от един оператор '=' в '{0}'.
zh: '{0}' 中有多个运算符 '='.

source: The expression on the right side must be constant: "{0}".
bg: Изразът от дясната страна трябва да е константа: "{0}".
zh: 右侧的表达式必须是常量： "{0}".

# Inconsistent_units_for__0__equals__1__
source: Inconsistent units for "{0} = {1}".
bg: Несъвместими мерни единици за "{0} = {1}".
zh: "{0} = {1}" 的单位不一致.

# Inconsistent_units_for__0__equals__1__:__2__
source: Inconsistent units for "{0} = {1} : {2}".
bg: Несъвместими мерни единици за "{0} = {1} : {2}".
zh: "{0} = {1} : {2}" 的单位不一致.

source: No solution for: {0}.
bg: Няма решение за: {0}.
zh: {0} 无解.

source: Recursion is not allowed in function definition: "{0}".
bg: Не e разрешена рекурсия в дефиницията на функция: "{0}".
zh: 函数定义中不允许递归： "{0}".

# The_assignment_equals_must_be_preceded_by_custom_function_or_variable
source: The assignment '=' must be preceded by custom function or variable.
bg: Преди оператора за присвояване '=' трябва да има функция или променлива.
zh: 赋值 '=' 前面必须是自定义函数或变量.

# Assignment_equals_must_be_the_first_operator_in_the_expression
source: Assignment '=' must be the first operator in the expression.
bg: Преди оператора за присвояване '=' не може да има други оператори.
zh: 赋值 '=' 必须是表达式中的第一个运算符.

source: Invalid syntax: "{0} {1}".
bg: Невалиден синтаксис: "{0} {1}".
zh: 无效语法： "{0} {1}".

source: Unexpected delimiter ';'.
bg: Неочакван символ за разделител ';'.
zh: 错误的分隔符 ';'.

source: Invalid number of arguments.
bg: Невалиден брой аргументи на функция.
zh: 参数值无效.

source: The result is not a real number: "{0}".
bg: Резултатът не е реално число: "{0}".
zh: 结果不是实数： "{0}" .

source: Missing parameter in function definition.
bg: Липсва параметър в дефиниция на функция.
zh: 函数定义中缺少参数.

source: Missing delimiter in function definition.
bg: Липсва разделител в дефиниция на функция.
zh: 函数定义中缺少分隔符.

source: Invalid token in function definition: "{0}".
bg: Невалиден обект в дефиниция на функция: "{0}".
zh: 函数定义中的令牌无效： "{0}" .

source: Circular reference detected for function "{0}".
bg: Открита е циклична референция за функция "{0}".
zh: 检测到函数 "{0}" 的循环引用.

# InvalidFunctionDefinitionException
source: Invalid function definition. It has to match the pattern: "f(x; y; z...) =".
bg: Невалидна дефиниция на функция. Трябва да съответства на шаблона: \"f(x; y; z...) =\".
zh: 函数定义无效.它必须符合范式： "f (x; y; z...) =".

source: Argument out of range for {0}(x).
bg: Аргументът е извън допустимия интервал за {0}(x).
zh: {0}(x)的参数超出范围.

source: Condition cannot be empty.
bg: Условието не може да бъде празно.
zh: 条件不能为空.

source: Condition block not initialized with "#if".
bg: Условният блок не е инициализиран с "#if".
zh: 条件块未用 "#if" 初始化.

source: Duplicate "#else" in condition block.
bg: Може да има само едно "#else" в условен блок.
zh: 条件块中重复出现 "#else".

source: "#else if" is not allowed after "#else" in condition block.
bg: Не може да има "#else if" след "#else" в условен блок.
zh: 条件块中的 "#else"后不允许有 "#else if".

source: Condition cannot evaluate to a complex number.
bg: Условието не може да бъде комплексно число.
zh: 条件值不能计算为复数.

source: Condition result is invalid: {0}.
bg: Невалиден резултат от проверка на условие: {0}.
zh: 条件结果无效： {0}.

source: Duplicate macro parameter names: {0} and {1}.
bg: Дублиране на имената на параметрите на макрос: {0} и {1}.
zh: 宏参数名称重复： {0} 和 {1}.

source: Macro not defined: {0}.
bg: Недефиниран макрос: {0}.
zh: 未定义的宏：{0}.

source: Missing {0} in surface map command.
bg: Липсва {0} в команда за 2D графика.
zh: 曲面投影命令中缺少 {0}.

source: The limits of plot area are identical.
bg: Границите на чертожната площ съвпадат.
zh: 绘图区域的上下界限是相同(冲突)的.

source: Error writing a png file to "{0}".
bg: Грешка при запис на png файл като "{0}".
zh: 将png文件写入 "{0}" 时出错.

source: Error writing a svg file to "{0}".
bg: Грешка при запис на svg файл като "{0}".
zh: 将svg文件写入 "{0}" 时出错.

source: Error converting png to Base64.
bg: Грешка при конвертиране на png към Base64.
zh: 将png图片转换为Base64时出错.

source: Inconsistent units: "{0} {1} {2}".
bg: Несъвместими мерни единици: "{0} {1} {2}".
zh: 单位不一致： "{0} {1} {2}".

source: Units cannon be raised to complex power.
bg: Не мога да повдигна мерни единици на комплексна степен.
zh: 单位无法计算复数次幂.

source: Select _All
bg: И_збери всичко
zh: 全选

# if_block_not_closed_Missing_end_if
source: Error: "#if" block not closed. Missing "#end if".
bg: Грешка: Условният "#if" блок не е затворен. Липсва "#end if".
zh: 错误： "#if" 块未闭合.缺少 "#end if".

# Iteration_block_not_closed_Missing_loop
source: Error: Iteration block not closed. Missing "#loop".
bg: Грешка: Незатворен блок за итерации. Липсва "#loop".
zh: 错误:迭代块未闭合,缺失"#loop".

source: Unexpected error: {0} Please check the expression consistency.
bg: Неочаквана грешка: {0} Моля проверете коректността на израза.
zh: 意外错误： {0} 请检查表达式的一致性.

# Paused_Press_F5_to_continue
source: <p><span class="err">Paused!</span> Press <b>F5</b> to <a href="#0" data-text="continue">continue</a> or <b>Esc</b> to <a href="#0" data-text="cancel">cancel</a>.</p>
bg: <p><span class="err">Пауза!</span> натиснете <b>F5</b> за да <a href="#0" data-text="continue">продължите</a> или <b>Esc</b> за да <a href="#0" data-text="cancel">прекъснете</a>.</p>
zh: <p><span class="err">已暂停！</span>按<b>F5</b> <a href="#0" data-text="continue">继续</a>或<b>按Esc</b> <a href="#0" data-text="cancel">取消</a>.</p>

# Error_found_on_line
source: <div class="errorHeader">Found <b>1</b> error on line:
bg: <div class="errorHeader">Общо <b>1</b> грешка на ред:
zh: <div class="errorHeader">在以下行发现<b>1</b>个错误：

# Errors_found_on_lines
source: <div class="errorHeader">Found <b>{0}</b> errors on lines:
bg: <div class="errorHeader">Общо <b>{0}</b> грешки на редове:
zh: <div class="errorHeader">在以下行发现 <b>{0} </b>个错误：

source: Error in "{0}" on line {1}: {2}
bg: Грешка в "{0}" на ред {1}: {2}
zh: 第 {1}：{2} 行"{0}"出错

# Number_of_iterations_exceeds_the_maximum_0
source: Number of iterations exceeds the maximum {0}.</p>
bg: Броят на итерациите е по-голям от максималния {0}.</p>
zh: 迭代次数超过最大值 {0} !</p>

# loop_without_a_corresponding_repeat
source: "#loop" without a corresponding "#repeat", "#for" or "#while".
bg: "#loop" без съответен "#repeat", "#for" или "#while".
zh: "#loop" 没有对应的 #repeat", "#for", "#while".

source: Entangled "#if - #end if" and "#repeat - #loop" blocks.
bg: Преплитане на "#if - #end if" и "#repeat - #loop" блокове.
zh: 交错的 "#if - #end if" 和 "#repeat - #loop" 块.

source: "#continue" without a corresponding "#repeat".
bg: "#continue" без съответен "#repeat".
zh: "#continue" 没有对应的 "#repeat".

# Macro_definition_block_not_closed_Missing_end_def
source: Error: Macro definition block not closed. Missing "#end def".
bg: Грешка: Незатворена дефиниция на макрос. Липсва "#end def".
zh: #错误：宏定义块未闭合.缺少 "#end def".

source: Missing source file for include.
bg: Липсва изходен файл за вмъкване.
zh: 缺少要调用的源文件.

source: File not found.
bg: Файлът не е намерен.
zh: 文件未找到.

source: Invalid macro name: "{0}".
bg: Невалидно име на макрос: "{0}".
zh: 无效的宏名称： "{0}".

source: Invalid inside macro definition.
bg: Невалидно в дефиниция на макрос.
zh: 无效的内部宏定义.

source: "There is no matching "#def".
bg: "Няма съответен "#def".
zh: "没有匹配的 "#def".

source: Invalid symbol "{0}" in macro name.
bg: Невалиден символ "{0}" в име на макрос.
zh: 宏名称中的符号 "{0}" 无效.

source: Duplicate macro name: "{0}".
bg: Повтарящо се име на макрос: "{0}".
zh: 宏名称重复： "{0}".

# Missing_delimiter_0_in_plot_command
source: <span class = "err">Missing delimiter "{0}" in plot command "{1}".</span>
bg: <span class = "err">Липсва разделител "{0}" в команда за графика "{1}".</span>
zh: <span class = "err">绘图命令 "{1}" 中缺少分隔符"{0}".</span>

# Missing_0_in_plot_command_1
source: <span class = "err">Missing {0} in plot command "{1}".</span>.
bg: <span class = "err">Липсва {0} в команда за графика "{1}".</span>.
zh: <span class = "err">绘图命令 "{1}" 中缺少 {0}.</span>.

# More_than_one_delimiter_in_plot_command
source: <span class = "err">More than one delimiter "|" in plot command {0}.</span>
bg: <span class = "err">Разделителите "|" са повече от един в команда за графика {0}.</span>
zh: <span class = "err">绘图命令 {0} 中有多个分隔符"|".</span>

# Missing_delimiter_0_in_surface_map_command_1
source: <span class = "err">Missing delimiter "{0}" in surface map command "{1}".</span>
bg: <span class = "err">Липсва разделител "{0}" в команда за 2D графика "{1}".</span>
zh: <span class = "err">曲面投影命令 "{1}" 中缺少分隔符 "{0}"</span>

# Function_redefined
source: Warning! Function redefined.
bg: Внимание! Функцията е предефинирана.
zh: 警告！函数已重新定义.

source: Raise to square
bg: Степенуване
zh: 求平方

# Too_many_errors
source: Too many errors. Further calculations are skipped.
bg: Има твърде много грешки. Пропускам следващите изчисления.
zh: 错误过多,忽略后续计算.

source: Repeat block not closed. Missing loop.
bg: Грешка: Блокът за цикъл "#repeat" не е затворен. Липсва "#loop".
zh: 错误： "#repeat" 块未闭合.缺少 "#loop" !

source: Index
bg: Индекс
zh: 索引

source: Missing vector opening bracket "[".
bg: Липсва отваряща скоба за вектор "[".
zh: 向量缺失起始左括号"[".

source: Bracket mismatch.
bg: Преплитане на скоби.
zh: 括号不匹配.

source: must be scalar.
bg: трябва да е скалар.
zh: 必须为标量.

source: Index out of range:
bg: Индексът е извън границите:
zh: 索引号超出范围:

source: Cannot assign vector to scalar.
bg: Не мога да присвоя вектор на скалар.
zh: 无法将向量赋值给标量.

source: Missing vector closing bracket "]".
bg: Липсва затваряща скоба на вектор "]".
zh: 向量缺失右括号"]".

source: must be vector.
bg: трябва да бъде вектор.
zh: 必须为向量.

source: must be positive integer.
bg: трябва да бъде положително цяло число.
zh: 必须为正整数.

source: Step cannot be zero.
bg: Стъпката не може да е нула.
zh: 步长不能为0.

source: Vector size cannot exceed
bg: Размерът на вектора не може да надвишава
zh: 向量尺寸超出程序能力

source: Cross product is defined only for vectors with 2 and 3 elements.
bg: Векторното произведение е дефинирано само за вектори с 2 или 3 елемента.
zh: 叉积仅对2和3个元素的向量有定义.

source: Function {0} is not defined in complex mode.
bg: Функцията {0} не е дефинирана в комплексен режим.
zh: 函数{0}在复数模式下未定义.

source: Matrix dimensions do not match.
bg: Размерите на матриците на се съответни.
zh: 矩阵维度不匹配.

source: Matrix must be square.
bg: Матрицата трябва да е квадратна.
zh: 矩阵必须为方阵.

# The_Lp_norm_argument_must_be_p_ge_1
source: The Lp norm argument must be p ≥ 1.
bg: Аргументът на Lp нормата трябва да е p ≥ 1.
zh: Lp范数的参数必满足p≥1.

source: Matrix must be symmetric.
bg: Матрицата трябва да е симетрична.
zh: 矩阵必须对称.

source: Matrix is not positive definite.
bg: Матрицата не е положително дефинирана.
zh: 矩阵非正定.

source: Matrix is singular.
bg: Матрицата е особена.
zh: 矩阵为奇异阵.

source: Matrix is singular or close to singular.
bg: Матрицата е особена или близка до особена.
zh: 矩阵为奇异或接近奇异.

source: Vectors and matrices are not supported in complex mode.
bg: Векторите и матриците не се поддържат в комплексен режим.
zh: 复数模式下不支持向量和矩阵.

source: Cannot interpolate with non-scalar value.
bg: Не мога да интерполирам с не-скаларна стойност.
zh: 无法对非标量值进行内插.

source: Jacobi iteration failed.
bg: Неуспешна итерация на Якоби.
zh: Jacobi迭代失败.

source: Invalid operand:
bg: Невалиден операнд:
zh: 无效运算对象:

source: Invalid argument:
bg: Невалиден аргумент:
zh: 无效参数:

source: The argument is not an eigenvalue:
bg: Аргументът не е собствена стойност:
zh: 参数不是特征值:

source: The QL algorithm failed to converge.
bg: Няма сходимост на QL алгоритъма.
zh: QL算法不收敛.

source: Matrix size cannot exceed
bg: Размерът на матрицата не може да надвишава
zh: 矩阵大小超出程序能力

source: The number of matrix rows must be greater than or equal to the number of columns
bg: Броят на редовете на матрицата трябва да бъде по-голям или равен на броя на колоните
zh: 矩阵行数必大于等于列数

source: Count
bg: Броят
zh: 计数

source: Number of rows
bg: Броят редове
zh: 行的数量

source: Number of columns
bg: Броят колони
zh: 列的数量

source: Argument
bg: Аргументът
zh: 参数

source: Result
bg: Резултатът
zh: 结果

source: Variable
bg: Променливата
zh: 变量

source: Index target
bg: Индексирания обект
zh: 索引目标

source: Invalid item
bg: Невалиден обект
zh: 无效项

source: Cannot evaluate remainder: "{0} % {1}". Denominator must be unitless.
bg: Не мога да изчисля остатъка: "{0} % {1}". Делителя трябва да е бездименсионен.
zh: 无法计算:"{0}%{1}"的余子,分母必须为无单位值.

source: Cannot evaluate remainder: "{0} % {1}". The denominator must be unitless.
bg: Не мога да изчисля остатъка: "{0} % {1}". Делителя трябва да е бездименсионен.
zh: 无法计算:"{0}%{1}"的余子,分母必须为无单位值.
